{
  "data": {
    "markdown": "Search\n\nCtrl+K\n\nToggle theme [Login](https://accounts.x.ai/check-login?redirect=grokipedia-com&return_to=%2Fpage%2FJoe_Biden)\n\nToggle theme\n\nSearch\n\nCtrl+K\n\nTheme\n\nLightDarkSystem\n\n- [Joe Biden](https://grokipedia.com/page/Joe_Biden#joe-biden)\n- [Early life and education](https://grokipedia.com/page/Joe_Biden#early-life-and-education)\n- [Family background and childhood](https://grokipedia.com/page/Joe_Biden#family-background-and-childhood)\n- [Education and personal challenges](https://grokipedia.com/page/Joe_Biden#education-and-personal-challenges)\n- [Early political career](https://grokipedia.com/page/Joe_Biden#early-political-career)\n- [Legal practice and entry into politics](https://grokipedia.com/page/Joe_Biden#legal-practice-and-entry-into-politics)\n- [Local offices in Delaware](https://grokipedia.com/page/Joe_Biden#local-offices-in-delaware)\n- [U.S. Senate career](https://grokipedia.com/page/Joe_Biden#us-senate-career)\n- [Elections and initial terms](https://grokipedia.com/page/Joe_Biden#elections-and-initial-terms)\n- [Key legislative roles and foreign policy](https://grokipedia.com/page/Joe_Biden#key-legislative-roles-and-foreign-policy)\n- [Presidential campaigns of 1988 and 2008](https://grokipedia.com/page/Joe_Biden#presidential-campaigns-of-1988-and-2008)\n- [Vice Presidency](https://grokipedia.com/page/Joe_Biden#vice-presidency)\n- [Selection and domestic initiatives](https://grokipedia.com/page/Joe_Biden#selection-and-domestic-initiatives)\n- [Foreign engagements and controversies](https://grokipedia.com/page/Joe_Biden#foreign-engagements-and-controversies)\n- [Path to 2020 presidential candidacy](https://grokipedia.com/page/Joe_Biden#path-to-2020-presidential-candidacy)\n- [Post-vice presidency activities](https://grokipedia.com/page/Joe_Biden#post-vice-presidency-activities)\n- [2020 campaign and election](https://grokipedia.com/page/Joe_Biden#2020-campaign-and-election)\n- [Presidency](https://grokipedia.com/page/Joe_Biden#presidency)\n- [Inauguration and early actions](https://grokipedia.com/page/Joe_Biden#inauguration-and-early-actions)\n- [Domestic policy and economic management](https://grokipedia.com/page/Joe_Biden#domestic-policy-and-economic-management)\n- [Foreign policy decisions](https://grokipedia.com/page/Joe_Biden#foreign-policy-decisions)\n- [2024 re-election effort and withdrawal](https://grokipedia.com/page/Joe_Biden#2024-re-election-effort-and-withdrawal)\n- [Post-presidency](https://grokipedia.com/page/Joe_Biden#post-presidency)\n- [Transition and initial activities](https://grokipedia.com/page/Joe_Biden#transition-and-initial-activities)\n- [Health diagnosis and ongoing treatment](https://grokipedia.com/page/Joe_Biden#health-diagnosis-and-ongoing-treatment)\n- [Personal life](https://grokipedia.com/page/Joe_Biden#personal-life)\n- [Marriages and family](https://grokipedia.com/page/Joe_Biden#marriages-and-family)\n- [Religious beliefs and personal tragedies](https://grokipedia.com/page/Joe_Biden#religious-beliefs-and-personal-tragedies)\n- [Health and cognitive fitness](https://grokipedia.com/page/Joe_Biden#health-and-cognitive-fitness)\n- [Historical medical issues](https://grokipedia.com/page/Joe_Biden#historical-medical-issues)\n- [Debates over mental acuity during presidency](https://grokipedia.com/page/Joe_Biden#debates-over-mental-acuity-during-presidency)\n- [Controversies and criticisms](https://grokipedia.com/page/Joe_Biden#controversies-and-criticisms)\n- [Academic and ethical lapses](https://grokipedia.com/page/Joe_Biden#academic-and-ethical-lapses)\n- [Family business involvements](https://grokipedia.com/page/Joe_Biden#family-business-involvements)\n- [Policy failures and executive actions](https://grokipedia.com/page/Joe_Biden#policy-failures-and-executive-actions)\n- [Political positions and ideology](https://grokipedia.com/page/Joe_Biden#political-positions-and-ideology)\n- [Evolution on key issues](https://grokipedia.com/page/Joe_Biden#evolution-on-key-issues)\n- [Views on race, crime, and economy](https://grokipedia.com/page/Joe_Biden#views-on-race-crime-and-economy)\n- [References](https://grokipedia.com/page/Joe_Biden#references)\n\nFact-checked by Grokyesterday\n\n# Joe Biden\n\n**Joseph Robinette Biden Jr.** (born November 20, 1942) is an American politician and attorney who served as the 46th president of the United States from January 20, 2021, to January 20, 2025.\\[1\\]\\[2\\] A member of the Democratic Party, he represented Delaware in the U.S. Senate from 1973 to 2009, becoming one of its longest-serving members, and then served as the 47th vice president under Barack Obama from 2009 to 2017.\\[3\\]\\[4\\]In the Senate, Biden chaired the Judiciary Committee from 1987 to 1995, overseeing high-profile Supreme Court confirmations, and the Foreign Relations Committee from 2001 to 2003 and again from 2007 to 2008, shaping U.S. policy on issues like the Iraq War authorization.\\[5\\] As president, he signed the Infrastructure Investment and Jobs Act in November 2021, directing over $1 trillion toward roads, bridges, broadband, and other projects amid bipartisan support.\\[6\\] However, his term faced severe empirical setbacks, including consumer price inflation peaking at 9.1% year-over-year in June 2022—the highest in over 40 years—driven by expansive fiscal stimulus and supply disruptions; a disorganized Afghanistan withdrawal in August 2021 that ended with a suicide bombing killing 13 U.S. service members at Kabul's Abbey Gate; and unprecedented southwest border migrant encounters exceeding 10 million from fiscal years 2021 to 2024, per Customs and Border Protection data, straining resources and enforcement.\\[7\\] These outcomes, alongside visible signs of cognitive impairment that prompted his July 2024 decision to forgo reelection, defined a presidency criticized for prioritizing progressive spending over fiscal and security prudence.\\[8\\]\n\n## Early life and education\n\n### Family background and childhood\n\nJoseph Robinette Biden Jr. was born on November 20, 1942, in Scranton, Pennsylvania, to Joseph Robinette Biden Sr., a used car salesman, and Catherine Eugenia \"Jean\" Finnegan Biden, a homemaker.\\[5\\]\\[9\\] The family maintained strong Irish Catholic roots, with Biden's ancestry tracing predominantly to Ireland through both parental lines, including the Blewitt and Finnegan families from County Mayo and County Louth.\\[10\\]\\[11\\]Biden's early years in Scranton occurred amid his father's post-World War II economic difficulties, including two failed business ventures in asphalt paving and furniture stripping that contributed to financial instability.\\[5\\]\\[9\\] In 1953, when Biden was 10, the family relocated to an apartment in the working-class suburb of Claymont, Delaware, after Joseph Sr. secured a job selling cars for a Wilmington dealership, seeking relief from Scranton's declining anthracite coal industry and ongoing hardships.\\[5\\]\\[12\\] The move reflected broader patterns of mid-20th-century economic migration from Rust Belt communities, where Biden experienced a modest, blue-collar upbringing marked by his parents' emphasis on resilience amid repeated setbacks.\\[5\\]As a child, Biden struggled with a stutter that caused bullying and social isolation, which he addressed through self-directed efforts such as reciting poetry—often William Butler Yeats—in front of a mirror to build fluency and confidence.\\[13\\]\\[14\\] These formative experiences in Pennsylvania and Delaware, within a devout Catholic household that attended Mass regularly, instilled a personal ethic of perseverance without external therapy or medical intervention during his youth.\\[13\\]\\[14\\]\n\n### Education and personal challenges\n\nBiden attended Archmere Academy, a Catholic preparatory school in Claymont, Delaware, where he was elected class president during his junior and senior years.\\[15\\]\\[16\\]He enrolled at the University of Delaware in 1961, participating in football and student activities while majoring in history and political science. Biden graduated in June 1965 with a Bachelor of Arts degree, describing himself as an average student who prioritized social engagements over rigorous study.\\[15\\]In 1965, Biden entered Syracuse University College of Law, where he faced academic difficulties, including failing a torts class due to plagiarism in a paper, which he attributed to poor note-taking habits rather than intent. He graduated in 1968 with a Juris Doctor, ranking 76th in a class of 85, near the bottom academically.\\[17\\]\\[18\\]\\[19\\]Throughout his education, Biden contended with a childhood stutter that persisted into adolescence, leading to bullying and self-perceived stigma associating the condition with low intelligence in mid-20th-century views. He overcame it through deliberate practice, such as reading aloud from speeches by politicians like John F. Kennedy and reciting poetry in front of mirrors, which he credited with building resilience and public speaking ability despite early humiliations.\\[14\\]\\[20\\]\\[21\\]Following law school, Biden worked briefly as a clerk for a Wilmington law firm led by Republican attorney William Prickett, handling basic legal tasks amid his developing interest in public service. He later served short stints as a public defender and associate at a personal injury firm, experiences he later invoked to highlight perseverance amid unremarkable early professional starts.\\[22\\]\\[23\\]\\[24\\]\n\n## Early political career\n\n### Legal practice and entry into politics\n\nBiden earned his Juris Doctor from Syracuse University College of Law in 1968 and was admitted to the Delaware Bar in 1969, after which he commenced legal practice in Wilmington.\\[1\\] He initially joined a corporate law firm, where he handled cases defending large businesses, but his time in private practice was short-lived and produced no major public cases or legal precedents.\\[5\\] Seeking more direct public service, he transitioned briefly to the Delaware Public Defender's office in 1969, representing indigent clients in criminal matters, though this phase too lasted only months before he pivoted to electoral politics.\\[25\\]Influenced by the era's anti-Vietnam War activism—having co-chaired Eugene McCarthy's 1968 presidential campaign in Delaware—and frustrations with unchecked suburban sprawl, zoning decisions, and perceived ethical lapses in local governance, Biden decided to run for office in 1970.\\[26\\] At age 27, he sought a seat on the New Castle County Council as a Democrat, targeting the district encompassing Wilmington's growing suburbs amid rapid post-World War II development.\\[27\\] His campaign highlighted the need for orderly management of population growth, stricter zoning to curb haphazard expansion, and greater transparency to restore public trust, positioning him as a fresh alternative to entrenched interests.\\[28\\]Biden defeated the Republican incumbent, Lawrence T. Messick, in the November 1970 general election, securing the at-large seat with a plurality in a three-way race that underscored emerging Democratic gains in Delaware's suburban electorate.\\[29\\] This victory marked an early indicator of shifting political dynamics in New Castle County, where economic growth and demographic changes eroded traditional Republican dominance, enabling younger, issue-focused candidates like Biden to prevail.\\[30\\] He served one two-year term from 1970 to 1972, using the platform to advocate for development controls without delving into substantive legislative outputs reserved for subsequent roles.\\[1\\]\n\n### Local offices in Delaware\n\nBiden entered elective politics in 1970, when, at age 27, he won election to the New Castle County Council representing the 4th District, unseating the incumbent Republican councilman Lawrence T. Messick in a traditionally GOP-leaning area that encompassed parts of Wilmington's suburbs.\\[31\\]\\[22\\] His campaign emphasized liberal priorities, including expanded public housing options in suburban zones to address urban-suburban divides amid Delaware's postwar growth.\\[1\\] He assumed office in early 1971 and served until January 1973.\\[32\\]As a councilman, Biden focused on curbing unchecked industrial expansion during New Castle County's development surge, notably leading opposition to a proposed Shell Oil refinery upgrade that threatened local air quality and residential areas near the Delaware River.\\[33\\] This stance reflected his early emphasis on environmental protections and community impacts from rapid commercialization, aligning with broader 1970s concerns over suburban sprawl fueled by federal highway projects and population influx from nearby Pennsylvania and New Jersey.\\[34\\] His tenure involved advocating for regulatory measures to balance economic growth with livability, though specific zoning overhauls remained contentious among county developers and conservative stakeholders.\\[35\\]Biden's local service lasted less than two full years, as he resigned following his November 7, 1972, victory in the U.S. Senate race against incumbent J. Caleb Boggs, a surprise upset that propelled him to national office at age 29.\\[36\\] This swift pivot from county-level governance underscored his early political ambition and leveraged his council experience to build voter recognition in Delaware's most populous county, home to over half the state's residents at the time.\\[5\\]\n\n## U.S. Senate career\n\n### Elections and initial terms\n\nBiden secured the Democratic nomination for the U.S. Senate in Delaware in 1972 after defeating U.S. Representative James M. Higgins in the September primary, capitalizing on anti-incumbent sentiment amid the Watergate-era political climate.\\[32\\] In the general election on November 7, 1972, the 29-year-old Biden upset incumbent Republican Senator J. Caleb Boggs, who was seeking a third term and had been considered a strong favorite due to his prior electoral successes and Nixon administration endorsements.\\[32\\]\\[37\\] Biden received 116,006 votes (50.5 percent) to Boggs's 112,844 (49.1 percent), a margin of just over 3,000 votes in a state with a Republican lean at the time.\\[38\\]Biden turned 30 years old on November 20, 1972, meeting the constitutional minimum age for senators, and was sworn in on January 5, 1973, becoming the sixth-youngest U.S. senator at the time.\\[39\\]\\[40\\] Tragically, on December 18, 1972—just weeks after the election—his wife Neilia and daughter Naomi were killed in an automobile collision near Hockessin, Delaware, while his sons Beau and Hunter sustained severe injuries requiring extended hospitalization.\\[32\\] Undeterred, Biden maintained his commitment to the role by instituting a daily Amtrak commute of about 200 miles round-trip from Wilmington to Washington, D.C., often working through the night and returning home to care for his recovering sons, a practice he continued for much of his early Senate tenure.\\[32\\]During his first terms, Biden prioritized domestic issues including consumer protection measures against deceptive practices and environmental safeguards amid growing awareness of pollution and resource depletion in the post-Earth Day era.\\[41\\] Assigned to the Senate Judiciary Committee early in his tenure, he leveraged the position to forge bipartisan alliances, particularly with moderate Democrats and Republicans on procedural and oversight matters, helping to establish his reputation as a pragmatic operator in a chamber dominated by longer-serving members.\\[42\\] Biden solidified his electoral base in subsequent cycles, winning re-election in 1978 against Republican James H. Fidler by a comfortable margin and again in 1984 against John M. Burris amid Ronald Reagan's landslide presidential victory, demonstrating resilience in a small, politically competitive state.\\[43\\]\n\n### Key legislative roles and foreign policy\n\nBiden served as chair of the Senate Judiciary Committee from 1987 to 1995 and again from 2001 to 2003, positions in which he influenced judicial nominations and criminal justice legislation.\\[44\\] In 1987, as chair, he presided over the confirmation hearings for Robert Bork's Supreme Court nomination, questioning Bork extensively on his judicial philosophy and originalism, which contributed to the Senate's 58-42 rejection of Bork amid Democratic opposition to his conservative views.\\[45\\]\\[46\\] During the 1991 hearings for Clarence Thomas, Biden again chaired the proceedings, including the contentious testimony of Anita Hill alleging sexual harassment, after which Thomas was confirmed 52-48 despite the controversy; Thomas later criticized Biden's questioning as racially charged and the process as mishandled.\\[47\\]\\[48\\]Biden co-sponsored and advocated for elements of the 1994 Violent Crime Control and Law Enforcement Act, a bipartisan measure signed by President Clinton that allocated nearly $30 billion for 100,000 new police officers, prison construction, and \"three strikes\" provisions, aiming to reduce rising crime rates but later drawing criticism for contributing to increased incarceration, particularly among minorities, with federal funding incentivizing states to adopt tougher sentencing.\\[49\\]\\[50\\] The act's causal impact included a temporary decline in violent crime through expanded law enforcement, though empirical analyses attribute broader incarceration trends more to state-level policies predating it, amid ongoing debates over its role in mass imprisonment.\\[50\\]On the Senate Foreign Relations Committee, where Biden served as ranking member and later chair starting in 1997, he advocated for U.S. intervention in the Balkans to halt ethnic cleansing.\\[51\\] He pushed for lifting the arms embargo on Bosnia in 1992 and supported NATO's 1995 Dayton Accords and 1999 bombing campaign against Serbia over Kosovo, arguing military action was necessary to prevent genocide and stabilize the region, crediting U.S. leadership for averting wider European conflict.\\[52\\]\\[53\\] In 2002, Biden voted for the Iraq Resolution authorizing force against Saddam Hussein, citing weapons of mass destruction threats and regime change needs, but by 2007 opposed President Bush's troop surge, proposing instead a federalized partition of Iraq into sectarian regions with conditional U.S. withdrawal to foster political reconciliation over military escalation.\\[54\\]\\[55\\] These stances reflected Biden's emphasis on multilateral diplomacy and targeted interventions, though critics noted inconsistencies in post-invasion predictions of stability.\\[56\\]\n\n### Presidential campaigns of 1988 and 2008\n\nBiden formally launched his first presidential campaign on June 9, 1987, positioning himself as a centrist Democrat with extensive Senate experience on foreign policy and crime issues.\\[57\\] The effort quickly unraveled due to revelations of plagiarism and fabrications about his academic record. In September 1987, videos emerged showing Biden reciting nearly verbatim passages from British Labour leader Neil Kinnock's 1987 speech—phrases like \"Why am I the first Kinnock in a thousand generations to go to university?\"—without attribution during a campaign event in Iowa.\\[58\\] Further scrutiny uncovered similar uncredited lifts from speeches by Robert F. Kennedy, Hubert Humphrey, and John F. Kennedy, including Biden's reuse of Humphrey's line on economic populism.\\[59\\] These incidents, compounded by Biden's prior 1965 expulsion from Syracuse University Law School for plagiarism (later reduced to a grade sanction), raised questions about recurring ethical shortcuts in his preparation and presentation.\\[60\\]Parallel investigations exposed exaggerations in Biden's personal narrative, intended to bolster his working-class credentials. He claimed during campaign stops to have finished in the top half of his University of Delaware class, earned three undergraduate degrees, and received a full scholarship to law school while ranking 76th in his class—none of which were accurate; he held a single degree with a C average and no scholarship, graduating 76th out of 85 at Syracuse.\\[61\\] Biden acknowledged these as \"mistakes\" but defended them as rhetorical flourishes rather than deliberate deceit, though critics viewed them as emblematic of overreach in self-promotion.\\[62\\] Facing intensifying media scrutiny and eroding support, he suspended his campaign on September 23, 1987, less than four months after launch, citing the \"exaggerated shadow\" of these errors as overshadowing his message.\\[57\\]Biden's second bid began with an exploratory committee on January 31, 2007, followed by formal announcement, emphasizing his foreign policy expertise and ability to bridge party divides.\\[63\\] However, he struggled with visibility and fundraising, polling consistently below 2% nationally and failing to break through in a crowded Democratic field dominated by Hillary Clinton, Barack Obama, and John Edwards.\\[64\\] Lacking momentum, Biden withdrew on January 3, 2008, immediately after the Iowa caucuses where he garnered under 1% of the vote, endorsing Obama shortly thereafter.\\[65\\] This early exit highlighted strategic miscalculations in resource allocation and messaging, as Biden's focus on niche issues like experience in committee hearings did not resonate broadly with primary voters seeking change. The campaigns collectively underscored patterns of vulnerability to personal scandals and an apparent overestimation of his national appeal, rooted in ethical lapses and unforced errors that derailed both efforts before key contests.\\[66\\]\n\n## Vice Presidency\n\n### Selection and domestic initiatives\n\nBarack Obama selected Joe Biden as his vice presidential running mate on August 23, 2008, citing Biden's extensive foreign policy experience from over three decades in the Senate, including as chair of the Foreign Relations Committee, to complement Obama's relative inexperience in national security matters.\\[67\\] Obama also valued Biden's appeal to working-class voters in Rust Belt states, his Catholic background for outreach to that demographic, and his ability to provide steady, tested judgment amid the financial crisis.\\[68\\] Biden was sworn in as the 47th vice president on January 20, 2009, following Obama's inauguration.\\[69\\]As vice president, Biden was tasked with overseeing the implementation of the American Recovery and Reinvestment Act (ARRA), signed into law on February 17, 2009, which allocated approximately $800 billion in stimulus spending for tax cuts, unemployment benefits, infrastructure, and state aid to counter the Great Recession.\\[70\\] Dubbed \"Sheriff Joe\" for his role in monitoring funds to prevent waste and fraud, Biden led efforts that GAO later credited with improving federal spending transparency through new reporting systems, though challenges in data accuracy persisted.\\[71\\] Empirical assessments indicate ARRA accelerated GDP growth by 1-3% in 2009-2010 and preserved or created millions of jobs, particularly in construction and education, but critics argued it contributed to long-term federal debt without fully addressing structural unemployment.\\[72\\]\\[73\\]Biden also played a key role in the Obama administration's $80 billion auto industry bailout, initiated in late 2008 and expanded in 2009, which provided loans and restructuring support to General Motors and Chrysler to avert bankruptcy amid the recession.\\[74\\] He claimed credit for guiding the effort, which Biden described as rescuing the industry \"from the brink of extinction,\" enabling repayment of most funds by 2011 and saving over one million jobs according to administration estimates.\\[75\\] Outcomes included GM's return to profitability and market leadership by 2010, with independent analyses confirming the intervention prevented deeper manufacturing collapse, though taxpayers incurred a net loss of about $14 billion after repayments and asset sales.\\[76\\]\\[77\\]Following the Sandy Hook Elementary School shooting on December 14, 2012, Obama appointed Biden to lead a task force on gun violence prevention, which issued recommendations in January 2013 for universal background checks, a renewed assault weapons ban, limits on high-capacity magazines, and improved mental health services.\\[78\\] Despite public support for some measures, such as background checks polling above 90%, congressional resistance—particularly from Senate Democrats facing NRA opposition—resulted in no major legislation passing, limiting the task force's direct impact to executive actions like enhanced ATF reporting on multiple handgun sales.\\[79\\] Biden's vice presidential tenure drew criticism for yielding few standalone legislative victories, with his influence often confined to oversight and advocacy rather than authoring transformative domestic laws.\\[70\\]\n\n### Foreign engagements and controversies\n\nAs Vice President, Biden conducted extensive international travel, representing the United States in more than 50 countries across multiple regions to advance diplomatic and policy objectives.\\[4\\] His portfolio included oversight of U.S. relations with Iraq, where he made eight trips by 2012 to support stabilization efforts following the troop surge, and broader engagement in Europe and Asia to counter emerging threats. In Ukraine, amid Russia's 2014 annexation of Crimea, Biden served as the primary U.S. interlocutor from 2014 to 2016, conducting frequent visits to bolster support for Kyiv's government and push anti-corruption measures essential for continued Western aid.\\[80\\]A pivotal aspect of Biden's Ukraine engagement involved pressuring for the ouster of Prosecutor General Viktor Shokin, whose tenure was widely criticized for failing to prosecute high-level corruption cases, thereby undermining reforms demanded by the U.S., European Union, and International Monetary Fund. In December 2015, during a meeting with Ukrainian leaders, Biden explicitly conditioned $1 billion in U.S. loan guarantees on Shokin's removal, stating that failure to act would result in withheld assistance; Shokin was dismissed the following month.\\[80\\]\\[81\\] This action aligned with bipartisan U.S. congressional urging, including a 2016 letter from Republican Senators Rob Portman, Mark Kirk, and Ron Johnson, who echoed calls for prosecutorial independence.\\[82\\]Biden advocated strongly for the 2015 Joint Comprehensive Plan of Action (JCPOA) with Iran, positioning it as a verifiable mechanism to extend Iran's nuclear breakout time and block pathways to weaponization without immediate military confrontation. In an April 2015 address to the Washington Institute for Near East Policy, he outlined the deal's provisions for intrusive inspections and sanctions relief tied to compliance, emphasizing its alignment with long-term non-proliferation goals over alternatives like preemptive strikes.\\[83\\]On Syria, Biden attributed the August 21, 2013, Ghouta chemical attack—estimated to have killed over 1,400 people—to the Assad regime with \"no doubt,\" asserting it possessed the munitions and had used such weapons previously, and declaring that those responsible \"will be held accountable.\"\\[84\\]\\[85\\] Despite this, the Obama administration, with Biden's involvement in Situation Room briefings, sought congressional authorization for potential strikes and ultimately prioritized diplomacy, including UN resolutions and Russian-brokered chemical weapons dismantlement, over kinetic action amid domestic opposition and alliance consultations.\\[86\\]\\[87\\]Biden's foreign engagements featured recurring verbal miscues that occasionally undermined perceptions of precision, including off-script comments during overseas visits that allies viewed as overly candid or undiplomatic, such as audible whispers of classified details on counterterrorism successes. These incidents, while often attributed to his unpolished style, prompted early critiques of his suitability for high-stakes diplomacy, with observers noting patterns of conflations and impulsive phrasing that later intensified scrutiny of executive fitness.\\[88\\]\n\n## Path to 2020 presidential candidacy\n\n### Post-vice presidency activities\n\nFollowing the end of his vice presidency on January 20, 2017, Biden pursued philanthropic and private endeavors while maintaining a public profile on foreign policy issues. In February 2017, he and his wife Jill established the Biden Foundation, a nonprofit organization focused on initiatives including cancer research, protection against violence, and community engagement, which raised $6.6 million in its first year.\\[89\\]\\[90\\]Biden authored and published his memoir _Promise Me, Dad: A Year of Hope, Hardship, and Purpose_ on November 14, 2017, which chronicled family hardships, including the 2015 death of his son Beau from brain cancer, and reflections on public service.\\[91\\] The book, along with paid speaking engagements, contributed significantly to the Bidens' income, with Joe and Jill reporting over $15 million in earnings from 2017 through 2018, primarily from speeches at universities and corporations—such as more than $1 million in college fees in 2018 alone—and book-related advances.\\[92\\]\\[93\\]\\[94\\]Biden continued to advocate for U.S. support of Ukraine against Russian influence, drawing on his prior vice presidential experience pressuring Kyiv on anti-corruption reforms. In a January 23, 2018, address at the Council on Foreign Relations, he outlined strategies for countering Kremlin aggression, emphasizing democratic resilience in Eastern Europe, including Ukraine.\\[95\\]As he positioned himself as an elder statesman contemplating future political involvement, Biden faced criticism in March and April 2019 over past physical interactions with women, including shoulder-touching and close proximity in photos and videos from events spanning his career. At least seven women publicly described encounters that made them uncomfortable, amid heightened sensitivity following the #MeToo movement; Biden responded in a video on April 3, 2019, acknowledging evolving social norms on personal space while defending his intentions as empathetic rather than inappropriate.\\[96\\]\\[97\\]\\[98\\]\n\n### 2020 campaign and election\n\nJoe Biden announced his candidacy for the 2020 Democratic presidential nomination on April 25, 2019, emphasizing unity against perceived threats to American values exemplified by the 2017 Charlottesville rally.\\[99\\] His campaign initially faced challenges in the early primaries, placing fourth in the Iowa caucuses on February 3, 2020, with 15.8% of the vote, and fifth in the New Hampshire primary on February 11, 2020, with 8.4%.\\[100\\] Biden rebounded decisively in the South Carolina primary on February 29, 2020, winning 48.7% amid strong African American voter support, which propelled endorsements from rivals like Pete Buttigieg and Amy Klobuchar.\\[101\\]On Super Tuesday, March 3, 2020, Biden secured victories in ten of fourteen states, including major delegate hauls in Texas, California, and North Carolina, transforming the race into a two-person contest with Bernie Sanders and prompting Sanders's suspension on April 8, 2020.\\[102\\] This pivot consolidated establishment Democratic support, shifting focus from progressive policy debates to anti-Trump messaging. At the Democratic National Convention, held virtually August 17–20, 2020, due to the COVID-19 pandemic, Biden accepted the nomination.\\[100\\]Biden selected California Senator Kamala Harris as his vice presidential running mate on August 11, 2020, a decision responding to progressive demands for a candidate appealing to women and minorities after Harris's own early primary exit; Harris, the first Black and South Asian American on a major-party ticket, had criticized Biden on busing and his Senate record during debates.\\[103\\]The general election campaign unfolded under COVID-19 restrictions, with Biden relying on virtual events and limited travel from his Wilmington, Delaware home—a approach dubbed the \"basement strategy\" by Trump, which minimized unscripted appearances and focused on television ads and mail-in voter outreach.\\[104\\] On November 3, 2020, Biden defeated incumbent Donald Trump, garnering 306 electoral votes to Trump's 232 and 81,283,501 popular votes (51.3%) to Trump's 74,223,975 (46.8%).\\[105\\]Biden's wins hinged on razor-thin margins in swing states: Arizona (10,457 votes, 0.3%), Georgia (11,779 votes, 0.2%), Wisconsin (20,682 votes, 0.6%), Michigan (154,188 votes, 2.8%), Pennsylvania (80,555 votes, 1.2%), and Nevada (33,596 votes, 2.4%), flipping all six from Trump's 2016 victories.\\[106\\] Trump immediately contested the results, alleging widespread fraud via expanded mail-in voting, procedural changes in battleground states, ballot harvesting, and late-night vote batches disproportionately favoring Biden; supporters cited affidavits from poll watchers, statistical anomalies in vote reporting, and instances like a Georgia water main break delaying counting. Over 60 lawsuits followed, with courts—including Trump-appointed judges—dismissing most on procedural grounds or insufficient evidence of outcome-altering fraud, though isolated irregularities like improper ballot handling were acknowledged in audits; Republican-led state legislatures and officials, such as Georgia's, conducted recounts affirming certifications.\\[107\\]\\[108\\]The transition was impeded by Trump's refusal to concede and directives limiting Biden team access to agencies until the General Services Administration's ascertainment on November 23, 2020, delaying briefings and funding amid ongoing litigation.\\[109\\] Congress certified Biden's electoral victory in a joint session on January 6–7, 2021, after protesters stormed the Capitol protesting perceived irregularities, resulting in five deaths and temporary evacuation; Vice President Pence presided, rejecting alternate electors from contested states.\\[110\\]\n\n## Presidency\n\n### Inauguration and early actions\n\nJoseph R. Biden Jr. was sworn in as the 46th president of the United States on January 20, 2021, during a ceremony at the U.S. Capitol amid heightened security following the January 6 riot.\\[111\\] In his inaugural address, Biden called for national unity, stating that \"without unity, there is no peace, only bitterness and fury,\" positioning it as essential to addressing crises like the COVID-19 pandemic and political division, though the speech occurred against a backdrop of deep partisan polarization.\\[111\\]\\[112\\]On his first day in office, Biden issued 17 executive actions, including a proclamation terminating the national emergency declared by President Trump for southern border security and redirecting funds away from border wall construction, effectively halting further work.\\[113\\] He also signed an executive order initiating the process to rejoin the Paris Agreement on climate change, with the U.S. formally reentering on February 19, 2021.\\[114\\] Regarding COVID-19, Biden pledged an aggressive vaccination campaign, initially targeting 1 million doses per day but raising the goal amid criticism that daily administrations had already exceeded that under the prior administration; by mid-2021, over 300 million doses had been administered under his strategy.\\[115\\] Early approval ratings reflected optimism, with Gallup polling showing 57% approval in February 2021.\\[116\\]A key early priority was the American Rescue Plan Act, a $1.9 trillion stimulus package signed into law on March 11, 2021, providing direct payments, enhanced unemployment benefits, and state aid without Republican support in Congress.\\[117\\] Economic analyses indicate the plan's large-scale spending contributed to subsequent inflation by excessively stimulating demand in an economy already recovering from pandemic restrictions, with effects evident in rising consumer prices later in 2021.\\[118\\]\\[119\\]\n\n### Domestic policy and economic management\n\nBiden signed the Infrastructure Investment and Jobs Act into law on November 15, 2021, authorizing $1.2 trillion in total spending over five years, including $550 billion in new federal investments for transportation, broadband expansion, water systems, and resilience against climate and cyber threats.\\[6\\]\\[120\\] The legislation aimed to address long-deferred maintenance on roads, bridges, and ports, with funds distributed primarily through state and local governments to stimulate construction and job creation in infrastructure sectors.\\[121\\] Subsequent acts included the CHIPS and Science Act, enacted August 9, 2022, which allocated $52.7 billion to bolster domestic semiconductor manufacturing, research, and workforce development, prohibiting recipients from expanding facilities in China amid national security concerns.\\[122\\]\\[123\\] These measures sought to enhance supply chain resilience and technological competitiveness, though implementation faced delays due to permitting and environmental reviews.The Inflation Reduction Act, signed August 16, 2022, directed approximately $370 billion toward clean energy incentives, drug price negotiations for Medicare, and tax reforms, but its title belied limited immediate effects on broader price pressures, as inflation had already peaked earlier that year.\\[124\\] Empirical analyses attribute the surge in consumer prices—reaching a 40-year high of 9.1 percent year-over-year in June 2022—to a combination of pandemic-induced supply disruptions, the $1.9 trillion American Rescue Plan enacted in March 2021, and elevated energy costs from geopolitical events and restricted domestic production.\\[125\\]\\[126\\] Real gross domestic product grew robustly at 5.9 percent in 2021 amid recovery, moderating to 2.1 percent in 2022 and averaging around 2.5 percent annually through 2024, supported by consumer spending and fiscal outlays but tempered by interest rate hikes to combat inflation.\\[127\\]Unemployment averaged below 4 percent for much of the administration, dipping to 3.4 percent in early 2023—the lowest in over 50 years—reflecting labor market tightness from stimulus and pent-up demand, though participation rates remained subdued relative to pre-pandemic levels.\\[128\\] Real average hourly earnings, adjusted for inflation, declined by about 2.5 percent cumulatively from 2021 to mid-2023 as price increases outpaced nominal wage gains, eroding purchasing power for lower- and middle-income households despite recent recoveries.\\[129\\] Regulatory expansions under Biden included enhanced environmental protections via executive orders and EPA rules on emissions, alongside labor initiatives like union-friendly procurement preferences, which proponents credited for worker protections but critics argued imposed compliance costs contributing to business uncertainty and slower investment.\\[130\\]Efforts to forgive student loan debt faced repeated judicial setbacks; the Supreme Court invalidated the administration's plan for up to $430 billion in broad relief on June 30, 2023, ruling it exceeded statutory authority under the HEROES Act.\\[131\\] Subsequent targeted forgiveness through income-driven repayment adjustments, such as the SAVE plan, was partially blocked by federal courts in 2024 and 2025, limiting scalability and raising concerns over fiscal precedents without congressional approval.\\[132\\] Overall, while infrastructure and industrial policies laid foundations for long-term productivity, short-term economic management grappled with inflationary fallout from expansionary fiscal measures, with the Federal Reserve's aggressive rate increases— from near-zero to over 5 percent by 2023—credited for eventual disinflation without triggering recession.\\[124\\]\n\n### Foreign policy decisions\n\nOne of the most consequential foreign policy decisions of the Biden administration was the completion of the U.S. military withdrawal from Afghanistan, announced on April 14, 2021, with all 2,500 remaining troops to depart by September 11, 2021, later adjusted to August 31. This adhered to the framework of the February 2020 Doha Agreement negotiated under President Trump, which set a May 2021 deadline, but Biden opted to extend and execute it despite warnings from military commanders about the Afghan government's fragility and the risk of Taliban resurgence. The rapid collapse of Afghan forces led to the fall of Kabul on August 15, 2021, triggering a chaotic evacuation under Operation Allies Refuge, which airlifted approximately 123,000 people but culminated in a suicide bombing at Kabul's Abbey Gate on August 26, killing 13 U.S. service members and over 170 Afghans. Critics, including senior U.S. generals involved in the operation, attributed the disorder to inadequate planning and insufficient troop levels for securing the airport, resulting in the abandonment of billions in U.S. military equipment to Taliban forces and a humanitarian crisis marked by the group's swift reimposition of strict Islamic rule, including restrictions on women's rights and education. Empirical assessments highlight the withdrawal's causal failures: it ended U.S. combat involvement after 20 years but empowered the Taliban without establishing stable governance, leading to over 1,000 terrorist attacks in Afghanistan and Pakistan in the following year alone, as tracked by the U.S. National Counterterrorism Center.In response to Russia's full-scale invasion of Ukraine on February 24, 2022, the Biden administration coordinated extensive economic sanctions and military aid, imposing the first tranche on February 22 targeting Russian banks and elites, freezing $300 billion in Russian central bank assets held abroad, and later expanding to energy exports and technology imports. These measures, enacted via executive orders like EO 14024, aimed to degrade Russia's war economy, which contracted by 2.1% in 2022 per International Monetary Fund data, though adaptation through parallel imports mitigated long-term impacts. The U.S. allocated $182.8 billion in emergency funding for Ukraine since February 2022, including $61.4 billion in direct military aid such as HIMARS systems, Javelin missiles, and Patriot defenses, which enabled Ukrainian forces to inflict significant casualties—estimated at over 600,000 Russian troops killed or wounded by mid-2025 per U.S. intelligence. This support bolstered NATO unity, with allies contributing an additional $100 billion-plus, but raised escalation risks, including nuclear rhetoric from Moscow and debates over indirect U.S. involvement via real-time intelligence sharing, without resolving the stalemate as Russian advances continued in eastern Ukraine.To address strategic competition with China, the administration pursued the AUKUS security pact, announced on September 15, 2021, committing the U.S., UK, and Australia to share nuclear propulsion technology for Australian submarines, enhancing deterrence in the Indo-Pacific amid Beijing's military buildup in the South China Sea and around Taiwan. This trilateral framework extended to cooperation on cyber, AI, and quantum technologies, signaling a shift from multilateral forums like the Quad toward targeted alliances, though implementation faced delays due to U.S. submarine production constraints and Australian domestic politics. Broader China policy emphasized export controls on semiconductors and critical minerals, restricting $50 billion-plus in advanced tech transfers since 2022, which slowed Huawei's 5G dominance but prompted Chinese retaliation in rare earth supplies.Following Hamas's October 7, 2023, attack on Israel killing 1,200 and taking 250 hostages, Biden affirmed U.S. support, deploying the USS Gerald R. Ford carrier group and approving $17.9 billion in security assistance by October 2024, including precision-guided munitions and Iron Dome interceptors, to sustain Israel's defense operations in Gaza. Despite domestic campus protests and calls for ceasefires, aid continuity persisted, with an additional $21.7 billion in military transfers through September 2025, framed as countering Iranian-backed terrorism rather than endorsing all Israeli tactics. This stance prioritized alliance reliability over humanitarian pauses, though it drew criticism for enabling over 40,000 Palestinian deaths per Gaza Health Ministry figures (contested for including combatants), underscoring tensions between deterrence and escalation in the Middle East.\n\n### 2024 re-election effort and withdrawal\n\nBiden formally announced his candidacy for a second term on April 25, 2023, through a three-minute video released on social media platforms, portraying the election as a contest between democracy and extremism associated with Donald Trump. The campaign emphasized continuity of his administration's policies amid economic recovery from the COVID-19 pandemic and legislative achievements like the Infrastructure Investment and Jobs Act, though it encountered early hurdles including low approval ratings hovering around 40% in national polls throughout 2023.The effort gained momentum through the Democratic primaries in early 2024, where Biden secured victories in Iowa, New Hampshire, Nevada, and South Carolina without significant opposition, effectively clinching the nomination by Super Tuesday on March 5, 2024. However, persistent concerns about his age—81 at the time of the general election—and cognitive fitness lingered, fueled by public gaffes and special counsel Robert Hur's February 2024 report describing Biden's memory as \"hazy\" and \"poor.\" These issues intensified scrutiny within the Democratic Party, though Biden dismissed them as partisan attacks.The turning point occurred during the first presidential debate against Trump on June 27, 2024, hosted by CNN in Atlanta. Biden's appearance was marked by halting speech, incomplete sentences, and visible physical frailty, including a raspy voice and failure to counter Trump's attacks effectively on inflation and border security. Post-debate polls reflected widespread negative reactions: a CNN flash poll of viewers found 67% believed Trump won compared to 16% for Biden, while an Ipsos survey indicated fewer likely voters viewed Biden as mentally fit for office. National polling averages shifted dramatically, with Trump leading Biden by 3-5 points in battleground states by mid-July, according to aggregates from RealClearPolitics.\\[133\\]\\[134\\]This performance triggered a crisis within Democratic ranks, with over 30 congressional Democrats publicly urging Biden to withdraw by early July, citing electoral viability against Trump. Major donors, including Hollywood executives and Wall Street figures, withheld approximately $90 million in pledged funds and lobbied congressional leaders to pressure the president, arguing his continued candidacy risked down-ballot losses. Party dynamics revealed a disconnect between primary voters—who had reaffirmed Biden—and elite influencers prioritizing perceived winnability, with media outlets like The New York Times and MSNBC amplifying calls for replacement despite their historical alignment with Democratic narratives.\\[135\\]\\[136\\]On July 21, 2024, Biden suspended his campaign via a letter posted to his X account, stating the decision would allow Democrats to focus on defeating Trump without the distraction of his candidacy, though he cited no explicit health admission. He simultaneously endorsed Vice President Kamala Harris as the nominee, facilitating her rapid consolidation of delegates at the Democratic National Convention. The move, occurring after primaries but before the convention, underscored internal party maneuvering over voter input, as Biden had won over 14 million primary votes.\\[137\\]\\[138\\]Harris's subsequent campaign ended in defeat on November 5, 2024, with Trump securing 312 electoral votes to Harris's 226 and a popular vote margin of about 1.5 million, reflecting broader voter dissatisfaction with the Biden-Harris administration's record on inflation, immigration, and foreign policy—issues polling showed as top concerns. This outcome validated pre-withdrawal fears of a Trump landslide, attributing the loss not merely to Biden's personal frailties but to policy failures under his leadership, as exit polls indicated economic discontent drove shifts among Hispanic, Black, and working-class voters toward Republicans.\\[139\\]\\[140\\]\n\n## Post-presidency\n\n### Transition and initial activities\n\nIn the final weeks of his presidency, Biden issued a surge of clemency actions, including a full and unconditional pardon for his son Hunter Biden on December 1, 2024, covering federal gun and tax convictions dating back a decade.\\[141\\]\\[142\\] This pardon reversed Biden's prior public commitments against interfering in Justice Department decisions regarding his family, and it encompassed offenses from 2014 to 2024.\\[143\\] Overall, Biden granted more acts of clemency than any previous president, including preemptive pardons to individuals not charged with crimes.\\[144\\] He departed the White House on January 20, 2025, after attending Donald Trump's inauguration, marking the end of his term and a 50-year career in national politics.\\[145\\] Following the event, Biden and Jill Biden traveled to central California for personal time before relocating primarily to Wilmington, Delaware.\\[146\\]Post-presidency, Biden maintained a low public profile initially, supported by a small staff in Delaware focused on administrative transition matters.\\[147\\] He began work on a memoir detailing his White House tenure and 2024 election withdrawal, securing a publishing deal reported at around $10 million in July 2025.\\[148\\]\\[149\\] By March 2025, the Bidens made their first major public outing to attend a Broadway production of _Othello_, signaling a gradual reemergence.\\[150\\]Biden's early activities included limited speeches and Democratic Party support, such as pledging to fundraise and campaign to help Democrats regain ground lost in 2024.\\[151\\] His first major address as a former president came on April 15, 2025, in Chicago, where he criticized the Trump administration's handling of Social Security, alleging it had \"taken a hatchet\" to the program amid payment processing issues.\\[152\\]\\[153\\] This event aligned with Democratic efforts to highlight the issue ahead of 2026 midterms, though Biden avoided direct mentions of Trump in some remarks.\\[154\\]\n\n### Health diagnosis and ongoing treatment\n\nOn May 18, 2025, former President Joe Biden was diagnosed with an aggressive form of prostate cancer that had metastasized to his bones, classified as Stage 4 with a Gleason score of 9, indicating high-risk disease.\\[155\\]\\[156\\]\\[157\\] The diagnosis followed reports of urinary issues prompting medical evaluation, which detected a prostate nodule, and occurred after Biden had left office in January 2025.\\[158\\]Biden's treatment regimen includes hormone therapy to target the hormone-sensitive cancer and a course of radiation therapy aimed at managing the bone metastases and primary tumor.\\[159\\]\\[160\\] He completed the radiation sessions on October 20, 2025, marking the transition to ongoing hormone management and monitoring, with his physicians noting the cancer's responsiveness to initial interventions but emphasizing its incurable advanced nature.\\[161\\]\\[162\\]\\[163\\]The public disclosure of the diagnosis was limited, with Biden's office stressing a focus on privacy amid the health challenges, leading to reduced public appearances and a shift toward family-supported recovery.\\[164\\]\\[165\\] This has included symbolic milestones, such as ringing a treatment completion bell with family members on October 21, 2025, while limiting engagements to essential matters.\\[166\\]\\[167\\] Ongoing care involves multidisciplinary oncology oversight, with hormone therapy continuing indefinitely to suppress tumor growth.\\[168\\]\\[169\\]\n\n## Personal life\n\n### Marriages and family\n\nJoe Biden married Neilia Hunter on August 27, 1966, after meeting in the Bahamas.\\[170\\] The couple had three children: sons Joseph R. \"Beau\" Biden III (born February 3, 1969) and Robert Hunter Biden (born February 4, 1970), and daughter Naomi Christina Biden (born November 8, 1971).\\[171\\]On December 18, 1972, Neilia Biden and infant daughter Naomi were killed in a car crash in Hockessin, Delaware, when their vehicle was struck by a tractor-trailer at a rural intersection; sons Beau, aged three, and Hunter, aged two, sustained serious injuries but survived.\\[172\\]\\[173\\]Biden married Jill Tracy Jacobs on June 17, 1977, in a ceremony at the United Nations chapel in New York City.\\[174\\] The couple had one daughter together, Ashley Blazer Biden, born on June 9, 1981.\\[175\\] Jill Biden raised Beau and Hunter as her own sons following the marriage.\\[176\\]Beau Biden, who served as Delaware's attorney general from 2007 to 2015, died on May 30, 2015, at age 46 from glioblastoma, a form of brain cancer.\\[177\\]\\[178\\]Hunter Biden has faced multiple legal proceedings, including a June 2024 conviction on three federal felony counts related to lying about his drug use on a firearm purchase form in 2018, and a September 2024 conviction on three felony tax offenses and six misdemeanor tax offenses for failing to pay over $1.4 million in taxes from 2016 to 2019.\\[179\\]\\[180\\] He received a presidential pardon from his father on December 1, 2024, covering offenses from January 1, 2014, to December 1, 2024.\\[181\\]Members of the Biden family have played supportive roles in Joe Biden's political campaigns, with Jill Biden frequently appearing as a surrogate and Ashley Biden involved in advocacy efforts; Beau Biden campaigned for his father prior to his death.\\[176\\]\\[182\\]\n\n### Religious beliefs and personal tragedies\n\nBiden was raised in a devout Irish Catholic family in Scranton, Pennsylvania, and has consistently identified as a practicing Roman Catholic throughout his public life.\\[183\\] He regularly attends Mass, including weekly services during his presidency, and has incorporated Catholic teachings, biblical references, and papal quotations into his speeches and personal reflections.\\[184\\]\\[185\\] Catholic leaders, such as Washington Cardinal Wilton Gregory, have described Biden's faith as sincere, though noting tensions with certain doctrinal positions.\\[186\\]Biden's personal life has been marked by profound tragedies that he has publicly linked to his Catholic faith as a source of endurance. On December 18, 1972, weeks after his election to the U.S. Senate, his first wife, Neilia Biden (age 30), and their daughter, Naomi (13 months), were killed in a car collision in Delaware when their vehicle was struck by a tractor-trailer while pulling out to buy a Christmas tree.\\[172\\]\\[173\\] His sons, Beau (age 4) and Hunter (age nearly 3), survived with severe injuries, including broken bones and a fractured skull, respectively; Biden was sworn into office from his sons' hospital bedside on December 20.\\[187\\]\\[188\\]The death of his elder son, Beau Biden, on May 30, 2015, at age 46 from glioblastoma multiforme brain cancer compounded these losses.\\[177\\]\\[178\\] Diagnosed in 2013 following headaches and undergoing surgery, radiation, and chemotherapy, Beau experienced a temporary remission before the cancer's aggressive recurrence; he died at Walter Reed National Military Medical Center.\\[189\\]\\[190\\] As vice president, Biden attended the funeral Mass at St. Anthony of Padua Church in Wilmington, Delaware, and later detailed the grief in his 2017 memoir _Promise Me, Dad_, emphasizing faith, family support, and gradual healing through sharing experiences with others.\\[191\\]Biden has described these events as forging his resilience, often citing rosary prayers and Catholic rituals—such as attending daily Mass after Beau's diagnosis—as anchors amid profound sorrow, though he has acknowledged the private, ongoing nature of grief without formal therapy disclosures in verified accounts.\\[192\\] Critics, including some political commentators, have questioned whether repeated public invocations of these tragedies in speeches and campaigns serve primarily to cultivate a sympathetic \"resilience narrative\" rather than purely personal reflection.\\[193\\]\n\n## Health and cognitive fitness\n\n### Historical medical issues\n\nIn February 1988, Biden experienced severe neck pain leading to the discovery of a leaking intracranial berry aneurysm, for which he underwent emergency surgery at Walter Reed Army Medical Center to clip the aneurysm and prevent further bleeding.\\[194\\] A month later, he developed a pulmonary embolism requiring treatment with blood thinners.\\[195\\] In May 1988, a second aneurysm was detected on the right side of his brain, prompting another surgery to repair it, during which Biden suffered temporary paralysis in his left leg due to nerve compression, necessitating seven months of physical rehabilitation.\\[196\\] Medical evaluations following these procedures confirmed full recovery with no residual neurological deficits or cognitive impairment, as verified by his physicians.\\[194\\]Biden has managed a lifelong stutter since childhood, employing deliberate techniques such as reciting poetry, singing, and focusing on muscle movements during speech to control fluency, which he has publicly described as a \"debilitating situation\" that shaped his resilience.\\[197\\] These strategies, developed through self-observation and practice, allowed him to deliver public addresses effectively throughout his Senate career, though occasional verbal hesitations persisted.\\[13\\]Prior to 2020, Biden experienced minor physical mishaps, including trips during public events, but none resulted in significant injury or required medical intervention beyond routine care.\\[198\\]During his 2008 vice presidential campaign, Biden released detailed medical records affirming his complete recovery from the 1988 aneurysms and absence of ongoing vascular issues.\\[199\\] In the 2020 presidential campaign, his physician issued a summary report declaring him in \"excellent health\" with no history of malignancy, atrial fibrillation, or cerebrovascular disease beyond the resolved aneurysms, underscoring his physical vigor for office.\\[200\\] Biden pledged further disclosures via physical exams to demonstrate fitness, positioning his medical history as evidence of durability rather than limitation.\\[201\\]\n\n### Debates over mental acuity during presidency\n\nThroughout Joe Biden's presidency, observers documented an increase in public gaffes and instances of apparent confusion, such as on July 11, 2024, when he referred to Ukrainian President Volodymyr Zelenskyy as \"Vladimir Putin\" during a NATO summit press conference before correcting himself, and shortly after called Vice President Kamala Harris \"Vice President Trump.\"\\[88\\] These episodes fueled debates among political analysts and voters about his cognitive fitness, with critics pointing to patterns of verbal stumbles and disorientation in unscripted settings as evidence of diminished mental acuity beyond typical aging.\\[202\\]The June 27, 2024, presidential debate against Donald Trump marked a pivotal escalation in these concerns, as Biden's halting speech, incomplete sentences, and apparent struggles to maintain coherence were broadcast to millions, prompting immediate widespread commentary on his suitability for office.\\[134\\] Post-debate polls reflected sharp declines in public confidence; a CBS News survey found 72% of registered voters considered Biden cognitively unfit to serve as president, while a USA Today/Suffolk University poll showed 70% agreeing he lacked the mental health to fulfill duties effectively.\\[203\\] Even prior to the debate, skepticism was evident, with a February 2024 Quinnipiac University poll indicating 64% of voters viewed Biden as mentally unfit for a second term.\\[204\\]The February 2024 report by Special Counsel Robert Hur, following interviews with Biden in October 2023, provided an official assessment highlighting memory limitations, describing him as a \"sympathetic, well-meaning, elderly man with a poor memory\" who could not recall key details like the years of his vice presidency or the death of his son Beau in 2015.\\[205\\] Audio recordings of those sessions, released in May 2025, corroborated the lapses, including Biden's confusion over basic biographical timelines during discussions of classified documents related to Afghanistan policy.\\[206\\] Hur's findings, while declining to recommend charges, emphasized evidentiary challenges stemming from these impairments, intensifying scrutiny from congressional Republicans and commentators who argued the report revealed systemic risks to executive decision-making.\\[207\\]Allegations emerged of deliberate efforts by Biden's inner circle to mitigate perceptions of decline, as detailed in Jake Tapper and Alex Thompson's 2025 book _Original Sin_, which drew on insider accounts to claim aides imposed strict schedules limiting public engagements, rehearsed responses extensively, and shielded him from rigorous interactions to conceal cognitive deterioration.\\[208\\] The book asserts this \"cover-up\" extended to downplaying early signs during the 2021-2023 period, with staff prioritizing controlled environments over transparency, a narrative echoed in reports of Biden's reduced workload and reliance on teleprompters.\\[209\\] Defenders, including White House officials, countered that such measures addressed normal age-related fatigue rather than pathology, attributing debate shortcomings to a cold and travel rather than inherent unfitness, and noted the absence of any clinical diagnosis of dementia or similar conditions from Biden's physicians.\\[210\\]Critics, applying causal reasoning to observed lapses, contended that diminished acuity plausibly contributed to flawed policy execution, such as the chaotic August 2021 Afghanistan withdrawal, where Biden's insistence on the August 31 deadline amid Taliban advances was linked by some analysts to overconfidence rooted in selective recall of past decisions, as evidenced in retained classified notes he cited to vindicate his opposition to troop surges.\\[211\\] This perspective, advanced in post-presidency analyses, posits that unaddressed cognitive vulnerabilities impaired real-time crisis management, contrasting with Biden administration claims of deliberate strategic choices unaffected by personal limitations. Mainstream media outlets, often aligned with Democratic institutions, initially minimized these concerns as partisan attacks until the debate forced broader acknowledgment, highlighting potential biases in source credibility that delayed empirical scrutiny.\\[212\\]\n\n## Controversies and criticisms\n\n### Academic and ethical lapses\n\nDuring his first year at Syracuse University College of Law in 1965, Biden submitted a 15-page paper on municipal bonds that plagiarized five pages from a published law review article without citation, resulting in a failing grade and a requirement to retake the course after he admitted the lapse.\\[213\\]\\[214\\] He later characterized the incident as an inadvertent \"stupid mistake\" stemming from a misunderstanding of legal brief requirements, though the professor involved viewed it as a serious ethical breach at the time.\\[215\\]\\[216\\]Biden's 1987 presidential campaign collapsed amid revelations of further plagiarism, including unattributed lifting of phrasing from a speech by British Labour leader Neil Kinnock about humble origins, as well as embellishments of his academic record and personal history.\\[217\\] He falsely claimed to have finished in the top half of his law school class (he ranked 76th out of 85), received a full academic scholarship to law school (he had none, relying on loans and family support), and earned three undergraduate degrees from the University of Delaware (he received one degree with a double major).\\[218\\]\\[219\\] During a New Hampshire event, Biden also asserted multiple arrests for civil rights activism in the 1950s and 1960s, including one for attempting to visit Nelson Mandela in prison, claims lacking corroborating evidence and later revised to describe mere detentions or separations without formal arrests.\\[220\\]\\[221\\]These patterns resurfaced in the 2008 vice presidential campaign, where Biden repeated a story of being \"arrested\" once while trying to desegregate a Wilmington theater, only to later acknowledge it as an exaggeration of being tested or briefly detained without formal charges.\\[222\\]\\[223\\] In response to a 1987 voter confrontation over his credentials, Biden defensively challenged the man's intelligence by stating, \"I think I probably have a higher IQ than you do,\" amid broader scrutiny of his law school performance.\\[224\\]The recurrence of plagiarism and biographical inflation across decades, particularly during high-stakes campaigns, eroded Biden's credibility and contributed to his 1987 withdrawal from the presidential race, highlighting a consistent tendency toward unverified personal aggrandizement.\\[60\\]\\[225\\]\n\n### Family business involvements\n\nHunter Biden, son of then-Vice President Joe Biden, joined the board of directors of Burisma Holdings, Ukraine's largest private natural gas producer, in May 2014 and served until April 2019, receiving monthly compensation of approximately $50,000. This arrangement coincided with Joe Biden's role in overseeing U.S. anti-corruption efforts in Ukraine, including pressure on the Ukrainian government to dismiss prosecutor Viktor Shokin in March 2016.\\[226\\] Emails recovered from Hunter Biden's laptop, authenticated by the FBI and cited in congressional investigations, indicate Hunter referenced his father's influence in business discussions with Burisma executives, including efforts to secure meetings or support amid regulatory scrutiny.\\[227\\] While no direct evidence links Joe Biden to policy changes benefiting Burisma, the company's founder Mykola Zlochevsky faced investigations that U.S. officials viewed as stalled due to corruption concerns.In dealings with Chinese entities, Hunter Biden pursued ventures linked to CEFC China Energy, a firm with ties to the Chinese Communist Party, beginning in 2017. Bank records show payments totaling millions from CEFC-linked accounts to Biden family members and associates, including a $3 million wire to a joint venture involving Hunter and James Biden in August 2017, followed by distributions such as $40,000 to Joe Biden in September 2017 via his brother James.\\[228\\] These transactions occurred shortly after Joe Biden's vice presidential tenure ended but during his continued public prominence; Hunter's emails and witness testimony describe invoking \"the Biden brand\" to facilitate deals.\\[229\\] Joe Biden has repeatedly denied knowledge of or discussions about his son's foreign business activities, stating in 2019 that he \"never spoke to \\[Hunter\\] about his business dealings\" and in 2023 affirming he \"never lied\" on the matter.\\[230\\] However, records show Joe Biden exchanged at least 54 emails with Hunter's business associate in 2014 and attended dinners with family business partners, per testimony from Hunter's former associate Devon Archer.\\[231\\]\\[232\\]House Oversight Committee investigations, drawing from bank records of over 20 shell companies, documented more than $20 million in foreign payments to Biden family members and associates from entities in Ukraine, China, Romania, and elsewhere between 2014 and 2019.\\[233\\] These funds flowed through layered transactions, often to family members without apparent business expertise, raising questions of influence peddling rather than legitimate services. The 2023-2024 impeachment inquiry into Joe Biden, initiated by the House, uncovered patterns of family members leveraging access to the vice president—such as 20+ phone calls and meetings with associates—but found no direct proof of bribery or policy quid pro quo involving Joe Biden himself.\\[234\\]\\[235\\] A key bribery allegation from an FBI informant was later discredited as fabricated.\\[236\\] Empirical patterns suggest the family's foreign earnings capitalized on perceived proximity to power, though causal links to specific official actions remain unproven absent direct evidence.\\[237\\]\n\n### Policy failures and executive actions\n\nThe Biden administration's withdrawal from Afghanistan in August 2021 resulted in the rapid collapse of the Afghan government and the Taliban regaining control, contrary to intelligence assessments that had warned of such risks if U.S. forces departed hastily. The operation led to the deaths of 13 U.S. service members in a suicide bombing at Kabul airport on August 26, 2021, amid chaotic evacuations that prioritized some civilians but left an estimated over 100,000 Afghan allies who had supported U.S. efforts—such as interpreters and contractors—stranded and vulnerable to Taliban reprisals.\\[238\\] The U.S. also abandoned significant military equipment, including aircraft, vehicles, and weapons valued at approximately $7 billion by the Department of Defense, much of which fell into Taliban hands, exacerbating regional instability without achieving a stable transition.\\[239\\] Administration officials defended the timeline as inherited from prior agreements, but critics, including military leaders, argued the execution ignored on-the-ground realities and prioritized speed over security, marking a causal failure in strategic planning.\\[240\\]Immigration enforcement policies under Biden saw a surge in southwest border encounters, totaling over 10.8 million since fiscal year 2021, including nearly 3 million inadmissible encounters in FY2024 alone, per Customs and Border Protection data aggregated by congressional oversight.\\[241\\] This included 5.5 million single adults, 2.66 million family units, and over 546,000 unaccompanied children, straining resources and leading to high recidivism rates as policies like catch-and-release expanded.\\[7\\] Concurrently, fentanyl overdose deaths reached a peak, with synthetic opioids implicated in approximately 73,000 fatalities in 2023 amid over 105,000 total drug overdoses, largely entering via the southern border despite interdiction efforts.\\[242\\]\\[243\\] The administration attributed increases to global supply chains and touted seizures, but empirical data linked lax border controls to facilitated trafficking, with causal ties to policy shifts like ending the Remain in Mexico program.\\[244\\]In handling classified documents, Biden retained and stored sensitive materials from his vice presidency at his Delaware home, including in an unsecured garage alongside personal items, as detailed in the February 2024 special counsel report.\\[205\\] The report concluded that Biden \"willfully retained and disclosed\" classified information, such as notes on Afghanistan policy shared with a ghostwriter, but recommended no charges due to insufficient evidence for conviction beyond reasonable doubt, citing Biden's age-related memory limitations as a jury would likely view him sympathetically.\\[245\\] This contrasted with stricter application to other cases, raising questions about selective enforcement, though the DOJ emphasized cooperation and lack of obstruction.\\[246\\]Economically, the administration initially characterized rising inflation as transitory, with Biden stating on July 19, 2021, that the surge was temporary and expected to abate.\\[247\\] This assessment, echoed by Treasury Secretary Janet Yellen, underestimated persistent pressures from fiscal stimulus and supply disruptions, leading to inflation peaking at 9.1% in June 2022 and eroding real wages.\\[248\\] Separately, Biden's August 2022 executive action to forgive up to $20,000 in student loans for millions—estimated at $400-430 billion in cost—was struck down by the Supreme Court on June 30, 2023, in _Biden v. Nebraska_, for exceeding statutory authority under the HEROES Act without congressional approval.\\[131\\] The ruling highlighted overreach, as the plan bypassed legislative processes amid debates over intergenerational equity, though subsequent targeted relief efforts continued via other channels.\\[249\\]\n\n## Political positions and ideology\n\n### Evolution on key issues\n\nBiden played a leading role in authoring the Violent Crime Control and Law Enforcement Act of 1994, which expanded federal death penalties, enabled trying juveniles as adults for certain violent crimes, and funded additional police hiring and prisons, measures he defended in Senate speeches as necessary to combat \"predators on our streets\" who were \"beyond the pale\" and preying on the vulnerable.\\[50\\]\\[250\\]\\[251\\] In 1977, as a senator opposing mandatory school busing for desegregation, he stated that unchecked integration could lead to his children growing up in \"a jungle, the jungle being a racial jungle with tensions having built so high that it is going to explode at some point,\" reflecting concerns over social order amid rapid demographic changes.\\[252\\] By his 2020 presidential campaign, however, Biden pledged to eliminate cash bail nationwide, describing it as a \"modern-day debtors' prison\" that exacerbated inequality, and supported incentives for states to reduce incarceration through federal grants, marking a departure from his earlier emphasis on punitive enforcement.\\[253\\]\\[254\\]On abortion, Biden's positions evolved from early Catholic-influenced reservations to unqualified support for expansive access. In 1974, shortly after entering the Senate, he voted against amendments allowing federal funding for abortions, citing moral qualms and stating he could not impose his personal Catholic views but sought compromise on public funding.\\[255\\] By the 1980s, he affirmed Roe v. Wade as correctly decided despite personal opposition, and in 2006, he reiterated that he did \"not view abortion as a choice and a right,\" advocating restrictions on federal funding while protecting the procedure's legality.\\[256\\]\\[257\\] During his presidency, following the 2022 Dobbs decision overturning Roe, Biden endorsed restoring it federally without gestational limits and directed agencies to expand access, including over-the-counter mifepristone, diverging from his prior nuanced stance on late-term procedures and public financing.\\[258\\]Biden long championed restrictions on firearms, including authoring provisions for the 1994 assault weapons ban within the crime bill, which prohibited certain semiautomatic rifles and high-capacity magazines for a decade, a measure he credited with reducing gun violence and later sought to reinstate.\\[259\\]\\[260\\] After the Supreme Court's 2022 Bruen decision invalidated subjective \"may-issue\" concealed carry licensing in New York—requiring demonstrable cause for permits—Biden expressed deep disappointment, arguing it undermined public safety amid rising urban violence, yet his administration pursued narrower reforms like the Bipartisan Safer Communities Act's enhanced background checks and red-flag provisions rather than directly challenging the expanded carry rights upheld by Bruen.\\[261\\]\\[262\\]Regarding trade and energy, Biden as vice president endorsed the Trans-Pacific Partnership in 2015, praising its labor and environmental standards despite union opposition, viewing it as a counter to Chinese influence.\\[263\\] During his 2019-2020 campaign, he shifted to opposition, pledging not to submit the deal for ratification and proposing renegotiation for stronger worker protections, aligning with Democratic base skepticism.\\[264\\] On fracking, Biden's 2020 campaign rhetoric included statements like \"no more\" new fracking during a September debate, interpreted as targeting fossil fuel expansion amid climate goals, but he later clarified no outright ban on existing operations, focusing instead on pausing new federal leases via executive order in January 2021 while permitting state-level continuation.\\[265\\]\\[266\\]\\[267\\] This moderated approach followed energy price spikes post-Russia's 2022 Ukraine invasion, prioritizing domestic production incentives over stringent curbs.\n\n### Views on race, crime, and economy\n\nIn the 1970s, Biden opposed mandatory school busing as a means of desegregation, arguing it would lead to social tensions; during a 1977 Senate hearing, he stated, \"Unless we do something about this, my children are going to grow up in a jungle, the jungle being a racial jungle with tensions having built so high that it is going to explode at some point.\"\\[252\\]\\[268\\] This position reflected his preference for voluntary integration measures over court-ordered transport of students, which he viewed as counterproductive to achieving lasting racial harmony without exacerbating community divisions.\\[269\\]By 2020, amid nationwide protests following George Floyd's death, Biden shifted emphasis toward condemning violence while pledging action on systemic racism; in a June 2 speech in Philadelphia, he vowed to \"reverse systemic racism with long overdue and concrete changes\" but explicitly rejected rioting as a response, stating protests must remain peaceful to honor the cause.\\[270\\]\\[271\\] During a September visit to Kenosha, Wisconsin, after unrest there, he urged \"optimism and unity,\" criticizing divisive rhetoric while calling for accountability in policing without endorsing property destruction or looting.\\[272\\] Conservatives have critiqued this as inconsistent with his earlier busing stance, accusing him of prioritizing progressive equity narratives over empirical evidence of riot-related damages exceeding $1 billion in insured losses nationwide.\\[273\\] Liberals, conversely, praised his focus on racial justice reforms as a necessary evolution addressing historical inequities.\\[271\\]On crime, Biden publicly rejected \"defund the police\" calls, stating in his March 1, 2022, State of the Union address, \"The answer is to fund the police with the resources they need,\" and proposing $17.4 billion in federal law enforcement funding to combat violent crime surges.\\[274\\]\\[275\\] At a February 2021 CNN town hall, he reiterated opposition to reducing police budgets, favoring reallocation toward community programs instead.\\[276\\] However, his Department of Justice pursued consent decrees imposing federal oversight on police departments found to exhibit patterns of excessive force or discrimination, including investigations and proposed agreements in cities like Louisville and Minneapolis initiated or advanced under his administration.\\[277\\]\\[278\\] These mechanisms, rooted in civil rights enforcement, required reforms such as bias training and accountability measures but drew conservative criticism for federalizing local policing, potentially demoralizing officers and correlating with homicide increases of 30% from 2019 to 2020 amid policy shifts.\\[279\\] Supporters from progressive circles lauded them as essential for equity and reducing disparate impacts on minority communities.\\[280\\]Regarding the economy, Biden proposed raising the corporate tax rate from 21% to 28% in his fiscal year 2025 budget, alongside increasing the corporate alternative minimum tax to 21% for large firms, aiming to generate revenue for social spending while arguing it would not harm competitiveness given international averages.\\[281\\]\\[282\\] This built on his campaign pledges to fund infrastructure and child tax credits partly through higher business levies, though implementation stalled in Congress. During his presidency, nominal average hourly earnings rose, but real wages—adjusted for inflation—declined initially as consumer prices surged 20.1% cumulatively from January 2021 to mid-2023, outpacing wage gains and eroding purchasing power by about 2-3% in peak periods before partial recovery.\\[129\\] By August 2025, real average hourly earnings showed a 1.1% year-over-year increase, yet overall real median household income stagnated relative to pre-2021 levels amid persistent inflation above the Federal Reserve's 2% target.\\[129\\] Conservatives contended such policies, including tax hikes and regulatory expansions, stifled growth and contributed to wage stagnation by discouraging investment, while liberals highlighted nominal job creation and targeted equity initiatives like the child tax credit expansion as advancing inclusive prosperity.\\[283\\]\\[284\\]\n\n## References\n\n001. [https://bioguideretro.congress.gov/Home/MemberDetails?memIndex=b000444](https://bioguideretro.congress.gov/Home/MemberDetails?memIndex=b000444)\n\n002. [https://bidenwhitehouse.archives.gov/administration/president-biden/](https://bidenwhitehouse.archives.gov/administration/president-biden/)\n\n003. [https://www.congress.gov/member/joseph-biden/B000444](https://www.congress.gov/member/joseph-biden/B000444)\n\n004. [https://obamawhitehouse.archives.gov/node/360106](https://obamawhitehouse.archives.gov/node/360106)\n\n005. [https://millercenter.org/president/biden/life-before-the-presidency](https://millercenter.org/president/biden/life-before-the-presidency)\n\n006. [https://www.congress.gov/bill/117th-congress/house-bill/3684](https://www.congress.gov/bill/117th-congress/house-bill/3684)\n\n007. [https://www.cbp.gov/newsroom/stats/southwest-land-border-encounters](https://www.cbp.gov/newsroom/stats/southwest-land-border-encounters)\n\n008. [https://www.bidenlibrary.gov/bidens/president-joseph-r-biden](https://www.bidenlibrary.gov/bidens/president-joseph-r-biden)\n\n009. [https://people.com/all-about-joe-biden-parents-8549198](https://people.com/all-about-joe-biden-parents-8549198)\n\n010. [https://abcnews.go.com/Politics/bidens-irish-roots-visits-ancestral-homeland/story?id=98472620](https://abcnews.go.com/Politics/bidens-irish-roots-visits-ancestral-homeland/story?id=98472620)\n\n011. [https://megansmolenyak.com/joey-from-scranton-vice-president-bidens-irish-roots/](https://megansmolenyak.com/joey-from-scranton-vice-president-bidens-irish-roots/)\n\n012. [https://joebiden.com/about/](https://joebiden.com/about/)\n\n013. [https://www.cnn.com/2020/02/05/politics/joe-biden-stutter](https://www.cnn.com/2020/02/05/politics/joe-biden-stutter)\n\n014. [https://www.pbs.org/wgbh/frontline/article/bidens-stutter-how-a-childhood-battle-shaped-his-approach-to-life-and-politics/](https://www.pbs.org/wgbh/frontline/article/bidens-stutter-how-a-childhood-battle-shaped-his-approach-to-life-and-politics/)\n\n015. [https://www.delawareonline.com/story/news/politics/joe-biden/2024/07/21/a-look-back-at-president-bidens-life-and-career/74297473007/](https://www.delawareonline.com/story/news/politics/joe-biden/2024/07/21/a-look-back-at-president-bidens-life-and-career/74297473007/)\n\n016. [https://www.tun.com/blog/joe-bidens-life-as-a-college-student/](https://www.tun.com/blog/joe-bidens-life-as-a-college-student/)\n\n017. [https://www.law.com/2021/01/19/biden-would-be-first-lawyer-president-without-a-jd-from-the-t-14-in-a-century/](https://www.law.com/2021/01/19/biden-would-be-first-lawyer-president-without-a-jd-from-the-t-14-in-a-century/)\n\n018. [https://www.yahoo.com/news/fact-check-rumor-says-biden-130000833.html](https://www.yahoo.com/news/fact-check-rumor-says-biden-130000833.html)\n\n019. [https://www.abajournal.com/news/article/biden-is-first-president-since-taft-to-have-a-law-degree-outside-of-t-14-his-law-prof-saw-presence](https://www.abajournal.com/news/article/biden-is-first-president-since-taft-to-have-a-law-degree-outside-of-t-14-his-law-prof-saw-presence)\n\n020. [https://www.latimes.com/politics/story/2019-09-15/joe-bidens-childhood-struggle-with-a-stutter](https://www.latimes.com/politics/story/2019-09-15/joe-bidens-childhood-struggle-with-a-stutter)\n\n021. [https://www.npr.org/2007/08/01/12389154/on-becoming-joe-biden](https://www.npr.org/2007/08/01/12389154/on-becoming-joe-biden)\n\n022. [https://northernvirginiamag.com/culture/culture-features/2021/01/15/joe-bidens-career-in-politics-spans-decades/](https://northernvirginiamag.com/culture/culture-features/2021/01/15/joe-bidens-career-in-politics-spans-decades/)\n\n023. [https://nypost.com/2021/09/13/biden-claims-first-job-offer-from-idaho-lumber-company-no-record-of-it/](https://nypost.com/2021/09/13/biden-claims-first-job-offer-from-idaho-lumber-company-no-record-of-it/)\n\n024. [https://www.buzzfeednews.com/article/henrygomez/joe-biden-public-defender](https://www.buzzfeednews.com/article/henrygomez/joe-biden-public-defender)\n\n025. [https://www.usatoday.com/story/news/politics/elections/2024/07/08/was-joe-biden-a-lawyer/74325701007/](https://www.usatoday.com/story/news/politics/elections/2024/07/08/was-joe-biden-a-lawyer/74325701007/)\n\n026. [https://livableworld.org/clw-and-joe-biden-the-early-years/](https://livableworld.org/clw-and-joe-biden-the-early-years/)\n\n027. [https://newjerseyglobe.com/fl/bidens-ties-to-new-jersey-go-back-to-his-first-local-campaign-in-1970/](https://newjerseyglobe.com/fl/bidens-ties-to-new-jersey-go-back-to-his-first-local-campaign-in-1970/)\n\n028. [https://jacobin.com/2020/02/yesterdays-man-case-against-joe-biden-busing](https://jacobin.com/2020/02/yesterdays-man-case-against-joe-biden-busing)\n\n029. [https://elections.delaware.gov/elections/resultsarchive/elect70/pdfs/1970.pdf](https://elections.delaware.gov/elections/resultsarchive/elect70/pdfs/1970.pdf)\n\n030. [https://www.delawareonline.com/story/opinion/2020/11/27/how-joe-biden-changed-delawares-and-americas-politics/6421726002/](https://www.delawareonline.com/story/opinion/2020/11/27/how-joe-biden-changed-delawares-and-americas-politics/6421726002/)\n\n031. [https://ballotpedia.org/Joe\\_Biden](https://ballotpedia.org/Joe_Biden)\n\n032. [https://www.npr.org/2007/10/08/14999603/bidens-road-to-senate-took-tragic-turn](https://www.npr.org/2007/10/08/14999603/bidens-road-to-senate-took-tragic-turn)\n\n033. [https://www.eenews.net/articles/bidens-51-years-of-bad-blood-with-big-oil/](https://www.eenews.net/articles/bidens-51-years-of-bad-blood-with-big-oil/)\n\n034. [https://www.naco.org/articles/biden-harris-roots-lie-county-government](https://www.naco.org/articles/biden-harris-roots-lie-county-government)\n\n035. [https://slate.com/news-and-politics/2019/06/joe-biden-1972-race-senate.html](https://slate.com/news-and-politics/2019/06/joe-biden-1972-race-senate.html)\n\n036. [https://www.cnn.com/politics/joe-biden-fast-facts](https://www.cnn.com/politics/joe-biden-fast-facts)\n\n037. [https://www.detroitnews.com/story/opinion/2020/11/11/opinion-joe-biden-luckiest-politician-american-history/6241598002/](https://www.detroitnews.com/story/opinion/2020/11/11/opinion-joe-biden-luckiest-politician-american-history/6241598002/)\n\n038. [https://uselectionatlas.org/RESULTS/state.php?fips=10&year=1972&f=0&off=3&elect=0](https://uselectionatlas.org/RESULTS/state.php?fips=10&year=1972&f=0&off=3&elect=0)\n\n039. [https://www.nytimes.com/1973/01/03/archives/biden-takes-oath-friday.html](https://www.nytimes.com/1973/01/03/archives/biden-takes-oath-friday.html)\n\n040. [https://www.thetimes-tribune.com/2023/01/05/50-years-ago-scranton-native-biden-sworn-in-as-us-senator/](https://www.thetimes-tribune.com/2023/01/05/50-years-ago-scranton-native-biden-sworn-in-as-us-senator/)\n\n041. [https://spectrumlocalnews.com/nys/buffalo/news/2024/07/24/biden-recap-american-politics-president-2020](https://spectrumlocalnews.com/nys/buffalo/news/2024/07/24/biden-recap-american-politics-president-2020)\n\n042. [https://www.washingtonpost.com/history/2021/01/11/youngest-senators-joe-biden/](https://www.washingtonpost.com/history/2021/01/11/youngest-senators-joe-biden/)\n\n043. [https://www.nytimes.com/2024/05/02/us/politics/biden-election-campaign-opponents.html](https://www.nytimes.com/2024/05/02/us/politics/biden-election-campaign-opponents.html)\n\n044. [https://www.judiciary.senate.gov/about/chairman/previous](https://www.judiciary.senate.gov/about/chairman/previous)\n\n045. [https://constitutioncenter.org/blog/on-this-day-senate-rejects-robert-bork-for-the-supreme-court](https://constitutioncenter.org/blog/on-this-day-senate-rejects-robert-bork-for-the-supreme-court)\n\n046. [https://thehill.com/opinion/campaign/517743-joe-biden-the-father-of-borking/](https://thehill.com/opinion/campaign/517743-joe-biden-the-father-of-borking/)\n\n047. [https://abcnews.go.com/Politics/justice-clarence-thomas-rebukes-biden-led-confirmation-hearings/story?id=67235780](https://abcnews.go.com/Politics/justice-clarence-thomas-rebukes-biden-led-confirmation-hearings/story?id=67235780)\n\n048. [https://www.nytimes.com/2019/04/25/us/politics/joe-biden-anita-hill.html](https://www.nytimes.com/2019/04/25/us/politics/joe-biden-anita-hill.html)\n\n049. [https://www.congress.gov/bill/102nd-congress/senate-bill/1241](https://www.congress.gov/bill/102nd-congress/senate-bill/1241)\n\n050. [https://www.brookings.edu/articles/did-the-1994-crime-bill-cause-mass-incarceration/](https://www.brookings.edu/articles/did-the-1994-crime-bill-cause-mass-incarceration/)\n\n051. [https://obamawhitehouse.archives.gov/realitycheck/node/110](https://obamawhitehouse.archives.gov/realitycheck/node/110)\n\n052. [https://balkaninsight.com/2024/07/26/as-biden-bows-out-whats-his-legacy-in-bosnia/](https://balkaninsight.com/2024/07/26/as-biden-bows-out-whats-his-legacy-in-bosnia/)\n\n053. [https://theintercept.com/2021/04/27/biden-nato-bombing-serbia-montenegro/](https://theintercept.com/2021/04/27/biden-nato-bombing-serbia-montenegro/)\n\n054. [https://www.nytimes.com/2020/01/12/us/politics/joe-biden-iraq-war.html](https://www.nytimes.com/2020/01/12/us/politics/joe-biden-iraq-war.html)\n\n055. [https://www.vox.com/policy-and-politics/2019/10/15/20849072/joe-biden-iraq-history-democrats-election-2020](https://www.vox.com/policy-and-politics/2019/10/15/20849072/joe-biden-iraq-history-democrats-election-2020)\n\n056. [https://www.factcheck.org/2019/09/bidens-record-on-iraq-war/](https://www.factcheck.org/2019/09/bidens-record-on-iraq-war/)\n\n057. [https://www.nytimes.com/1987/09/24/us/biden-withdraws-bid-for-president-in-wake-of-furor.html](https://www.nytimes.com/1987/09/24/us/biden-withdraws-bid-for-president-in-wake-of-furor.html)\n\n058. [https://www.theguardian.com/us-news/2020/sep/07/neil-kinnock-joe-biden-1987-scandal](https://www.theguardian.com/us-news/2020/sep/07/neil-kinnock-joe-biden-1987-scandal)\n\n059. [https://www.presidency.ucsb.edu/documents/trump-campaign-press-release-copy-that-joe-bidens-long-record-plagiarism](https://www.presidency.ucsb.edu/documents/trump-campaign-press-release-copy-that-joe-bidens-long-record-plagiarism)\n\n060. [https://www.washingtonpost.com/investigations/echoes-of-bidens-1987-plagiarism-scandal-continue-to-reverberate/2019/06/05/dbaf3716-7292-11e9-9eb4-0828f5389013\\_story.html](https://www.washingtonpost.com/investigations/echoes-of-bidens-1987-plagiarism-scandal-continue-to-reverberate/2019/06/05/dbaf3716-7292-11e9-9eb4-0828f5389013_story.html)\n\n061. [https://www.nytimes.com/2019/06/03/us/politics/biden-1988-presidential-campaign.html](https://www.nytimes.com/2019/06/03/us/politics/biden-1988-presidential-campaign.html)\n\n062. [https://time.com/5636715/biden-1988-presidential-campaign/](https://time.com/5636715/biden-1988-presidential-campaign/)\n\n063. [https://www.nytimes.com/cq/2007/01/31/cq\\_2212.html](https://www.nytimes.com/cq/2007/01/31/cq_2212.html)\n\n064. [https://www.npr.org/2008/01/04/17840876/biden-dodd-bow-out-of-presidential-race](https://www.npr.org/2008/01/04/17840876/biden-dodd-bow-out-of-presidential-race)\n\n065. [https://www.nbcnews.com/id/wbna22497443](https://www.nbcnews.com/id/wbna22497443)\n\n066. [https://www.businessinsider.com/plagiarism-scandal-joe-biden-first-presidential-run-1988-2019-3](https://www.businessinsider.com/plagiarism-scandal-joe-biden-first-presidential-run-1988-2019-3)\n\n067. [https://www.npr.org/2008/08/23/93902534/barack-obama-chooses-sen-joseph-biden-for-vp](https://www.npr.org/2008/08/23/93902534/barack-obama-chooses-sen-joseph-biden-for-vp)\n\n068. [https://www.cnbc.com/2021/03/26/why-former-president-barack-obama-picked-joe-biden-as-his-vp-we-couldnt-have-been-more-different.html](https://www.cnbc.com/2021/03/26/why-former-president-barack-obama-picked-joe-biden-as-his-vp-we-couldnt-have-been-more-different.html)\n\n069. [https://people.com/barack-obama-tells-voters-why-he-picked-joe-biden-vice-president-8622110](https://people.com/barack-obama-tells-voters-why-he-picked-joe-biden-vice-president-8622110)\n\n070. [https://www.npr.org/2020/04/12/828291434/great-recession-recovery-effort-shaped-a-key-part-of-bidens-record](https://www.npr.org/2020/04/12/828291434/great-recession-recovery-effort-shaped-a-key-part-of-bidens-record)\n\n071. [https://www.gao.gov/blog/2019/02/21/the-legacy-of-the-recovery-act](https://www.gao.gov/blog/2019/02/21/the-legacy-of-the-recovery-act)\n\n072. [https://www.urban.org/sites/default/files/publication/105113/lessons-from-arra-for-an-inclusive-recovery-from-the-pandemic.pdf](https://www.urban.org/sites/default/files/publication/105113/lessons-from-arra-for-an-inclusive-recovery-from-the-pandemic.pdf)\n\n073. [https://www.brookings.edu/articles/fighting-fraud-waste-and-abuse-the-2009-recovery-act/](https://www.brookings.edu/articles/fighting-fraud-waste-and-abuse-the-2009-recovery-act/)\n\n074. [https://obamawhitehouse.archives.gov/realitycheck/the-press-office/fact-sheet-obama-administration-auto-restructuring-initiative-general-motors](https://obamawhitehouse.archives.gov/realitycheck/the-press-office/fact-sheet-obama-administration-auto-restructuring-initiative-general-motors)\n\n075. [https://www.nbcnews.com/id/wbna43202466](https://www.nbcnews.com/id/wbna43202466)\n\n076. [https://www.politifact.com/article/2012/sep/06/did-obama-save-us-automobile-industry/](https://www.politifact.com/article/2012/sep/06/did-obama-save-us-automobile-industry/)\n\n077. [https://www.seattletimes.com/nation-world/white-house-promotes-auto-bailouts-cites-paybacks/](https://www.seattletimes.com/nation-world/white-house-promotes-auto-bailouts-cites-paybacks/)\n\n078. [https://www.aclu.org/documents/aclu-letter-vice-president-biden-recommendations-gun-violence-task-force](https://www.aclu.org/documents/aclu-letter-vice-president-biden-recommendations-gun-violence-task-force)\n\n079. [https://www.politico.com/news/2021/11/05/biden-gun-violence-legislation-519625](https://www.politico.com/news/2021/11/05/biden-gun-violence-legislation-519625)\n\n080. [https://www.usatoday.com/story/news/factcheck/2020/10/21/fact-check-joe-biden-leveraged-ukraine-aid-oust-corrupt-prosecutor/5991434002/](https://www.usatoday.com/story/news/factcheck/2020/10/21/fact-check-joe-biden-leveraged-ukraine-aid-oust-corrupt-prosecutor/5991434002/)\n\n081. [https://www.congress.gov/116/meeting/house/110331/documents/HMKP-116-JU00-20191211-SD440.pdf](https://www.congress.gov/116/meeting/house/110331/documents/HMKP-116-JU00-20191211-SD440.pdf)\n\n082. [https://oversightdemocrats.house.gov/sites/evo-subsites/democrats-oversight.house.gov/files/Fact%2520Sheet%2520re%2520Firing%2520of%2520Viktor%2520Shokin.pdf](https://oversightdemocrats.house.gov/sites/evo-subsites/democrats-oversight.house.gov/files/Fact%2520Sheet%2520re%2520Firing%2520of%2520Viktor%2520Shokin.pdf)\n\n083. [https://www.washingtoninstitute.org/policy-analysis/30th-anniversary-address-vice-president-joe-biden](https://www.washingtoninstitute.org/policy-analysis/30th-anniversary-address-vice-president-joe-biden)\n\n084. [https://edition.cnn.com/2013/08/27/world/meast/syria-civil-war](https://edition.cnn.com/2013/08/27/world/meast/syria-civil-war)\n\n085. [https://www.cbsnews.com/news/biden-no-doubt-assad-responsible-for-syria-chemical-weapons-attack/](https://www.cbsnews.com/news/biden-no-doubt-assad-responsible-for-syria-chemical-weapons-attack/)\n\n086. [https://www.politico.com/story/2013/09/joe-biden-lawmakers-syria-situation-room-096350](https://www.politico.com/story/2013/09/joe-biden-lawmakers-syria-situation-room-096350)\n\n087. [https://www.pewresearch.org/politics/2013/09/09/opposition-to-syrian-airstrikes-surges/](https://www.pewresearch.org/politics/2013/09/09/opposition-to-syrian-airstrikes-surges/)\n\n088. [https://www.theguardian.com/us-news/article/2024/jul/11/biden-nato-summit-sketch](https://www.theguardian.com/us-news/article/2024/jul/11/biden-nato-summit-sketch)\n\n089. [https://www.washingtonpost.com/politics/former-vice-president-biden-to-launch-foundation/2017/01/31/6f9ad434-e803-11e6-bf6f-301b6b443624\\_story.html](https://www.washingtonpost.com/politics/former-vice-president-biden-to-launch-foundation/2017/01/31/6f9ad434-e803-11e6-bf6f-301b6b443624_story.html)\n\n090. [https://philanthropynewsdigest.org/news/biden-to-close-foundation](https://philanthropynewsdigest.org/news/biden-to-close-foundation)\n\n091. [https://globalnews.ca/news/3603269/joe-biden-book-promise-me-dad/](https://globalnews.ca/news/3603269/joe-biden-book-promise-me-dad/)\n\n092. [https://www.cnn.com/2019/07/09/politics/joe-biden-tax-returns](https://www.cnn.com/2019/07/09/politics/joe-biden-tax-returns)\n\n093. [https://www.politico.com/story/2019/07/09/bidens-earned-15-million-after-obama-administration-1404153](https://www.politico.com/story/2019/07/09/bidens-earned-15-million-after-obama-administration-1404153)\n\n094. [https://subscriber.politicopro.com/article/2019/07/biden-raked-in-540k-as-penn-professor-1m-in-college-speaking-fees-1577271](https://subscriber.politicopro.com/article/2019/07/biden-raked-in-540k-as-penn-professor-1m-in-college-speaking-fees-1577271)\n\n095. [https://www.cfr.org/event/foreign-affairs-issue-launch-former-vice-president-joe-biden](https://www.cfr.org/event/foreign-affairs-issue-launch-former-vice-president-joe-biden)\n\n096. [https://www.nytimes.com/2019/04/02/us/politics/joe-biden-women-me-too.html](https://www.nytimes.com/2019/04/02/us/politics/joe-biden-women-me-too.html)\n\n097. [https://www.washingtonpost.com/politics/joe-bidens-affectionate-physical-style-with-women-comes-under-scrutiny/2019/03/31/a41a81d0-5275-11e9-8d28-f5149e5a2fda\\_story.html](https://www.washingtonpost.com/politics/joe-bidens-affectionate-physical-style-with-women-comes-under-scrutiny/2019/03/31/a41a81d0-5275-11e9-8d28-f5149e5a2fda_story.html)\n\n098. [https://www.theguardian.com/us-news/2019/apr/04/joe-biden-allegations-physical-behavior-women](https://www.theguardian.com/us-news/2019/apr/04/joe-biden-allegations-physical-behavior-women)\n\n099. [https://www.npr.org/2019/04/25/675382786/joe-biden-officially-announces-2020-presidential-run](https://www.npr.org/2019/04/25/675382786/joe-biden-officially-announces-2020-presidential-run)\n\n100. [https://ballotpedia.org/Joe\\_Biden\\_presidential\\_campaign%2C\\_2020](https://ballotpedia.org/Joe_Biden_presidential_campaign%2C_2020)\n\n101. [https://www.pbs.org/newshour/politics/biden-wins-south-carolina-democratic-primary](https://www.pbs.org/newshour/politics/biden-wins-south-carolina-democratic-primary)\n\n102. [https://www.npr.org/2020/03/04/811785729/biden-surges-on-super-tuesday-transforming-democratic-primary-into-2-man-race](https://www.npr.org/2020/03/04/811785729/biden-surges-on-super-tuesday-transforming-democratic-primary-into-2-man-race)\n\n103. [https://www.npr.org/2020/08/11/897427306/in-historic-pick-joe-biden-taps-kamala-harris-to-be-his-running-mate](https://www.npr.org/2020/08/11/897427306/in-historic-pick-joe-biden-taps-kamala-harris-to-be-his-running-mate)\n\n104. [https://www.politico.com/news/2020/06/24/dems-warm-to-bidens-bunker-strategy-338853](https://www.politico.com/news/2020/06/24/dems-warm-to-bidens-bunker-strategy-338853)\n\n105. [https://www.fec.gov/resources/cms-content/documents/2020presgeresults.pdf](https://www.fec.gov/resources/cms-content/documents/2020presgeresults.pdf)\n\n106. [https://www.npr.org/2020/12/02/940689086/narrow-wins-in-these-key-states-powered-biden-to-the-presidency](https://www.npr.org/2020/12/02/940689086/narrow-wins-in-these-key-states-powered-biden-to-the-presidency)\n\n107. [https://www.brookings.edu/articles/widespread-election-fraud-claims-by-republicans-dont-match-the-evidence/](https://www.brookings.edu/articles/widespread-election-fraud-claims-by-republicans-dont-match-the-evidence/)\n\n108. [https://law.justia.com/cases/wisconsin/supreme-court/2020/2020ap002038.html](https://law.justia.com/cases/wisconsin/supreme-court/2020/2020ap002038.html)\n\n109. [https://apnews.com/article/joe-biden-donald-trump-virus-outbreak-elections-voting-fraud-and-irregularities-2d39186996f69de245e59c966d4d140f](https://apnews.com/article/joe-biden-donald-trump-virus-outbreak-elections-voting-fraud-and-irregularities-2d39186996f69de245e59c966d4d140f)\n\n110. [https://www.npr.org/2021/01/07/954234902/congress-certifies-biden-victory-after-pro-trump-rioters-storm-the-capitol](https://www.npr.org/2021/01/07/954234902/congress-certifies-biden-victory-after-pro-trump-rioters-storm-the-capitol)\n\n111. [https://bidenwhitehouse.archives.gov/briefing-room/speeches-remarks/2021/01/20/inaugural-address-by-president-joseph-r-biden-jr/](https://bidenwhitehouse.archives.gov/briefing-room/speeches-remarks/2021/01/20/inaugural-address-by-president-joseph-r-biden-jr/)\n\n112. [https://www.bbc.com/news/world-us-canada-55656823](https://www.bbc.com/news/world-us-canada-55656823)\n\n113. [https://bidenwhitehouse.archives.gov/briefing-room/presidential-actions/2021/01/20/proclamation-termination-of-emergency-with-respect-to-southern-border-of-united-states-and-redirection-of-funds-diverted-to-border-wall-construction/](https://bidenwhitehouse.archives.gov/briefing-room/presidential-actions/2021/01/20/proclamation-termination-of-emergency-with-respect-to-southern-border-of-united-states-and-redirection-of-funds-diverted-to-border-wall-construction/)\n\n114. [https://2021-2025.state.gov/the-united-states-officially-rejoins-the-paris-agreement/](https://2021-2025.state.gov/the-united-states-officially-rejoins-the-paris-agreement/)\n\n115. [https://www.bbc.com/news/world-us-canada-55805428](https://www.bbc.com/news/world-us-canada-55805428)\n\n116. [https://news.gallup.com/poll/329384/presidential-approval-ratings-joe-biden.aspx](https://news.gallup.com/poll/329384/presidential-approval-ratings-joe-biden.aspx)\n\n117. [https://www.cbsnews.com/news/biden-signs-covid-relief-bill-american-rescue-plan-into-law/](https://www.cbsnews.com/news/biden-signs-covid-relief-bill-american-rescue-plan-into-law/)\n\n118. [https://www.sciencedirect.com/science/article/abs/pii/S026499932400292X](https://www.sciencedirect.com/science/article/abs/pii/S026499932400292X)\n\n119. [https://www.axios.com/2024/11/10/trump-policy-stimulus-inflation](https://www.axios.com/2024/11/10/trump-policy-stimulus-inflation)\n\n120. [https://bidenwhitehouse.archives.gov/briefing-room/statements-releases/2021/08/02/updated-fact-sheet-bipartisan-infrastructure-investment-and-jobs-act/](https://bidenwhitehouse.archives.gov/briefing-room/statements-releases/2021/08/02/updated-fact-sheet-bipartisan-infrastructure-investment-and-jobs-act/)\n\n121. [https://home.treasury.gov/news/featured-stories/infrastructure-investment-in-the-united-states](https://home.treasury.gov/news/featured-stories/infrastructure-investment-in-the-united-states)\n\n122. [https://www.congress.gov/crs-product/R47523](https://www.congress.gov/crs-product/R47523)\n\n123. [https://www.mckinsey.com/industries/public-sector/our-insights/the-chips-and-science-act-heres-whats-in-it](https://www.mckinsey.com/industries/public-sector/our-insights/the-chips-and-science-act-heres-whats-in-it)\n\n124. [https://www.federalreserve.gov/econres/notes/feds-notes/the-federal-reserves-responses-to-the-post-covid-period-of-high-inflation-20240214.html](https://www.federalreserve.gov/econres/notes/feds-notes/the-federal-reserves-responses-to-the-post-covid-period-of-high-inflation-20240214.html)\n\n125. [https://www.bls.gov/cpi/](https://www.bls.gov/cpi/)\n\n126. [https://www.federalreserve.gov/econres/feds/files/2025070pap.pdf](https://www.federalreserve.gov/econres/feds/files/2025070pap.pdf)\n\n127. [https://www.bea.gov/data/gdp/gross-domestic-product](https://www.bea.gov/data/gdp/gross-domestic-product)\n\n128. [https://www.bls.gov/charts/employment-situation/civilian-unemployment-rate.htm](https://www.bls.gov/charts/employment-situation/civilian-unemployment-rate.htm)\n\n129. [https://www.bls.gov/news.release/realer.nr0.htm](https://www.bls.gov/news.release/realer.nr0.htm)\n\n130. [https://www.federalreserve.gov/econres/notes/feds-notes/inflations-shared-dna-regional-and-global-factors-in-post-pandemic-core-inflation-20250919.html](https://www.federalreserve.gov/econres/notes/feds-notes/inflations-shared-dna-regional-and-global-factors-in-post-pandemic-core-inflation-20250919.html)\n\n131. [https://www.scotusblog.com/2023/06/supreme-court-strikes-down-biden-student-loan-forgiveness-program/](https://www.scotusblog.com/2023/06/supreme-court-strikes-down-biden-student-loan-forgiveness-program/)\n\n132. [https://studentaid.gov/announcements-events/idr-court-actions](https://studentaid.gov/announcements-events/idr-court-actions)\n\n133. [https://www.cnn.com/2024/06/28/politics/debate-poll-cnn-trump-biden](https://www.cnn.com/2024/06/28/politics/debate-poll-cnn-trump-biden)\n\n134. [https://www.ipsos.com/en-us/538-ipsos-june-2024-presidential-debate-poll](https://www.ipsos.com/en-us/538-ipsos-june-2024-presidential-debate-poll)\n\n135. [https://www.pbs.org/newshour/show/more-democratic-lawmakers-and-donors-call-on-biden-to-exit-the-2024-race](https://www.pbs.org/newshour/show/more-democratic-lawmakers-and-donors-call-on-biden-to-exit-the-2024-race)\n\n136. [https://www.cnbc.com/2024/07/18/democratic-donors-biden-drop-out-kamala-harris.html](https://www.cnbc.com/2024/07/18/democratic-donors-biden-drop-out-kamala-harris.html)\n\n137. [https://apnews.com/article/biden-drops-out-2024-election-ddffde72838370032bdcff946cfc2ce6](https://apnews.com/article/biden-drops-out-2024-election-ddffde72838370032bdcff946cfc2ce6)\n\n138. [https://www.cnn.com/2024/07/21/politics/joe-biden-drops-out-election](https://www.cnn.com/2024/07/21/politics/joe-biden-drops-out-election)\n\n139. [https://www.politico.com/2024-election/results/president/](https://www.politico.com/2024-election/results/president/)\n\n140. [https://www.pewresearch.org/politics/2025/06/26/behind-trumps-2024-victory-a-more-racially-and-ethnically-diverse-voter-coalition/](https://www.pewresearch.org/politics/2025/06/26/behind-trumps-2024-victory-a-more-racially-and-ethnically-diverse-voter-coalition/)\n\n141. [https://www.presidency.ucsb.edu/documents/statement-the-presidential-pardon-for-r-hunter-biden](https://www.presidency.ucsb.edu/documents/statement-the-presidential-pardon-for-r-hunter-biden)\n\n142. [https://www.npr.org/2024/12/01/g-s1-36324/president-biden-pardons-son-hunter](https://www.npr.org/2024/12/01/g-s1-36324/president-biden-pardons-son-hunter)\n\n143. [https://www.bbc.com/news/articles/cjwl3venz39o](https://www.bbc.com/news/articles/cjwl3venz39o)\n\n144. [https://www.pewresearch.org/short-reads/2025/02/07/biden-granted-more-acts-of-clemency-than-any-prior-president/](https://www.pewresearch.org/short-reads/2025/02/07/biden-granted-more-acts-of-clemency-than-any-prior-president/)\n\n145. [https://www.politico.com/live-updates/2025/01/20/donald-trump-inauguration-day-news-updates-analysis/joe-biden-leaves-washington-00199324](https://www.politico.com/live-updates/2025/01/20/donald-trump-inauguration-day-news-updates-analysis/joe-biden-leaves-washington-00199324)\n\n146. [https://www.nbcnewyork.com/news/politics/where-are-the-bidens-headed-after-the-inauguration/6114539/](https://www.nbcnewyork.com/news/politics/where-are-the-bidens-headed-after-the-inauguration/6114539/)\n\n147. [https://www.townandcountrymag.com/society/politics/a63459306/joe-biden-post-presidency-plans/](https://www.townandcountrymag.com/society/politics/a63459306/joe-biden-post-presidency-plans/)\n\n148. [https://www.axios.com/2025/01/17/biden-book-presidency-trump](https://www.axios.com/2025/01/17/biden-book-presidency-trump)\n\n149. [https://www.nytimes.com/2025/07/24/books/joe-biden-memoir-deal.html](https://www.nytimes.com/2025/07/24/books/joe-biden-memoir-deal.html)\n\n150. [https://www.eonline.com/news/1415156/jill-biden-shares-rare-look-at-her-and-joe-bidens-life-post-presidency](https://www.eonline.com/news/1415156/jill-biden-shares-rare-look-at-her-and-joe-bidens-life-post-presidency)\n\n151. [https://www.nbcnews.com/politics/joe-biden/bidens-want-back-in-rcna196956](https://www.nbcnews.com/politics/joe-biden/bidens-want-back-in-rcna196956)\n\n152. [https://www.cnn.com/2025/04/15/politics/biden-post-presidency-legacy-trump](https://www.cnn.com/2025/04/15/politics/biden-post-presidency-legacy-trump)\n\n153. [https://www.nbcnews.com/politics/joe-biden/biden-trump-social-security-first-post-presidency-speech-rcna201309](https://www.nbcnews.com/politics/joe-biden/biden-trump-social-security-first-post-presidency-speech-rcna201309)\n\n154. [https://www.politico.com/news/2025/04/15/biden-speech-donald-trump-00292450](https://www.politico.com/news/2025/04/15/biden-speech-donald-trump-00292450)\n\n155. [https://www.michiganmedicine.org/health-lab/what-does-joe-bidens-prostate-cancer-diagnosis-mean-older-patients](https://www.michiganmedicine.org/health-lab/what-does-joe-bidens-prostate-cancer-diagnosis-mean-older-patients)\n\n156. [https://pressroom.cancer.org/Joe-Biden-Prostate-Cancer-Statement](https://pressroom.cancer.org/Joe-Biden-Prostate-Cancer-Statement)\n\n157. [https://www.npr.org/2025/05/19/nx-s1-5403446/biden-metastatic-prostate-cancer-diagnosis-survival-rate](https://www.npr.org/2025/05/19/nx-s1-5403446/biden-metastatic-prostate-cancer-diagnosis-survival-rate)\n\n158. [https://nypost.com/2025/10/18/us-news/joe-biden-seen-publicly-for-first-time-since-beginning-radiation-therapy-for-prostate-cancer/](https://nypost.com/2025/10/18/us-news/joe-biden-seen-publicly-for-first-time-since-beginning-radiation-therapy-for-prostate-cancer/)\n\n159. [https://www.nbcnews.com/politics/joe-biden/biden-undergoes-skin-cancer-surgery-months-prostate-cancer-diagnosis-rcna229205](https://www.nbcnews.com/politics/joe-biden/biden-undergoes-skin-cancer-surgery-months-prostate-cancer-diagnosis-rcna229205)\n\n160. [https://www.theguardian.com/us-news/2025/oct/20/joe-biden-radiation-prostate-cancer](https://www.theguardian.com/us-news/2025/oct/20/joe-biden-radiation-prostate-cancer)\n\n161. [https://www.nytimes.com/2025/10/20/us/politics/biden-cancer-treatment-radiation-therapy.html](https://www.nytimes.com/2025/10/20/us/politics/biden-cancer-treatment-radiation-therapy.html)\n\n162. [https://nypost.com/2025/10/21/us-news/joe-biden-completes-radiation-treatment-for-aggressive-prostate-cancer/](https://nypost.com/2025/10/21/us-news/joe-biden-completes-radiation-treatment-for-aggressive-prostate-cancer/)\n\n163. [https://abcnews.go.com/Politics/biden-rings-bell-after-completing-radiation-therapy-cancer/story?id=126700915](https://abcnews.go.com/Politics/biden-rings-bell-after-completing-radiation-therapy-cancer/story?id=126700915)\n\n164. [https://www.newsweek.com/joe-biden-prostate-cancer-treatment-update-after-radiation-therapy-10910294](https://www.newsweek.com/joe-biden-prostate-cancer-treatment-update-after-radiation-therapy-10910294)\n\n165. [https://people.com/joe-biden-rings-the-bell-after-completing-radiation-treatment-for-cancer-11834024](https://people.com/joe-biden-rings-the-bell-after-completing-radiation-treatment-for-cancer-11834024)\n\n166. [https://www.cbsnews.com/news/biden-completes-round-of-radiation-therapy-aggressive-prostate-cancer/](https://www.cbsnews.com/news/biden-completes-round-of-radiation-therapy-aggressive-prostate-cancer/)\n\n167. [https://www.masslive.com/news/2025/10/joe-bidens-family-shares-major-health-update-amid-prostate-cancer-battle.html](https://www.masslive.com/news/2025/10/joe-bidens-family-shares-major-health-update-amid-prostate-cancer-battle.html)\n\n168. [https://www.nbcnews.com/politics/joe-biden/former-president-joe-biden-radiation-therapy-prostate-cancer-rcna237019](https://www.nbcnews.com/politics/joe-biden/former-president-joe-biden-radiation-therapy-prostate-cancer-rcna237019)\n\n169. [https://theconversation.com/joe-biden-has-prostate-cancer-with-bone-spread-an-oncologist-explains-what-you-need-to-know-257037](https://theconversation.com/joe-biden-has-prostate-cancer-with-bone-spread-an-oncologist-explains-what-you-need-to-know-257037)\n\n170. [https://www.usmagazine.com/celebrity-news/pictures/joe-bidens-family-wives-kids-grandkids-more-in-photos/](https://www.usmagazine.com/celebrity-news/pictures/joe-bidens-family-wives-kids-grandkids-more-in-photos/)\n\n171. [https://www.people.com/politics/joe-biden-kids-everything-to-know/](https://www.people.com/politics/joe-biden-kids-everything-to-know/)\n\n172. [https://www.history.com/this-day-in-history/december-18/joe-biden-loses-first-wife-and-daughter-in-tragic-car-accident](https://www.history.com/this-day-in-history/december-18/joe-biden-loses-first-wife-and-daughter-in-tragic-car-accident)\n\n173. [https://www.nytimes.com/1972/12/19/archives/bidens-wife-child-killed-in-car-crash.html](https://www.nytimes.com/1972/12/19/archives/bidens-wife-child-killed-in-car-crash.html)\n\n174. [https://www.brides.com/joe-biden-jill-biden-relationship-timeline-5086781](https://www.brides.com/joe-biden-jill-biden-relationship-timeline-5086781)\n\n175. [https://www.eonline.com/news/1421046/who-is-ashley-biden-a-guide-to-joe-bidens-family](https://www.eonline.com/news/1421046/who-is-ashley-biden-a-guide-to-joe-bidens-family)\n\n176. [https://millercenter.org/president/biden/family-life](https://millercenter.org/president/biden/family-life)\n\n177. [https://www.bbc.com/news/world-us-canada-32949891](https://www.bbc.com/news/world-us-canada-32949891)\n\n178. [https://apnews.com/general-news-d8f69eb645d74b7886387f713981b739](https://apnews.com/general-news-d8f69eb645d74b7886387f713981b739)\n\n179. [https://apnews.com/article/hunter-biden-gun-trial-federal-charges-delaware-5dd8a9380235c6360a1ddb691ef24a06](https://apnews.com/article/hunter-biden-gun-trial-federal-charges-delaware-5dd8a9380235c6360a1ddb691ef24a06)\n\n180. [https://www.justice.gov/archives/sco-weiss/pr/robert-hunter-biden-convicted-three-felony-tax-offenses-and-six-misdemeanor-tax-offenses](https://www.justice.gov/archives/sco-weiss/pr/robert-hunter-biden-convicted-three-felony-tax-offenses-and-six-misdemeanor-tax-offenses)\n\n181. [https://abcnews.go.com/US/timeline-hunter-biden-legal-political-scrutiny/story?id=102293605](https://abcnews.go.com/US/timeline-hunter-biden-legal-political-scrutiny/story?id=102293605)\n\n182. [https://www.cnbc.com/2024/07/06/bidens-family-trying-to-get-more-involved-in-campaign-as-long-simmering-tensions-with-aides-spill-out.html](https://www.cnbc.com/2024/07/06/bidens-family-trying-to-get-more-involved-in-campaign-as-long-simmering-tensions-with-aides-spill-out.html)\n\n183. [https://www.pewresearch.org/short-reads/2021/01/20/biden-only-second-catholic-president-but-nearly-all-have-been-christians-2/](https://www.pewresearch.org/short-reads/2021/01/20/biden-only-second-catholic-president-but-nearly-all-have-been-christians-2/)\n\n184. [https://www.cathstan.org/voices/bidens-catholic-faith-both-key-and-complex-part-of-his-legacy](https://www.cathstan.org/voices/bidens-catholic-faith-both-key-and-complex-part-of-his-legacy)\n\n185. [https://www.npr.org/2020/09/20/913667325/how-joe-bidens-faith-shapes-his-politics](https://www.npr.org/2020/09/20/913667325/how-joe-bidens-faith-shapes-his-politics)\n\n186. [https://catholicreview.org/cardinal-gregory-biden-sincere-in-his-faith-but-there-are-things-that-he-chooses-to-ignore/](https://catholicreview.org/cardinal-gregory-biden-sincere-in-his-faith-but-there-are-things-that-he-chooses-to-ignore/)\n\n187. [https://www.biography.com/political-figures/joe-biden-first-wife-daughter-car-accident-story](https://www.biography.com/political-figures/joe-biden-first-wife-daughter-car-accident-story)\n\n188. [https://www.senate.gov/artandhistory/history/common/generic/People\\_TakingtheOathinHospital.htm](https://www.senate.gov/artandhistory/history/common/generic/People_TakingtheOathinHospital.htm)\n\n189. [https://www.fredhutch.org/en/news/center-news/2015/06/beau-biden-treating-brain-cancer.html](https://www.fredhutch.org/en/news/center-news/2015/06/beau-biden-treating-brain-cancer.html)\n\n190. [https://www.cnn.com/2015/05/30/politics/obit-vice-president-son-beau-biden](https://www.cnn.com/2015/05/30/politics/obit-vice-president-son-beau-biden)\n\n191. [https://www.npr.org/2017/11/14/563672229/promise-me-joe-biden-on-loss-grief-and-recovery](https://www.npr.org/2017/11/14/563672229/promise-me-joe-biden-on-loss-grief-and-recovery)\n\n192. [https://www.psychologytoday.com/us/blog/finding-meaning-in-lifes-struggles/202008/joe-bidens-healing-journey-through-grief](https://www.psychologytoday.com/us/blog/finding-meaning-in-lifes-struggles/202008/joe-bidens-healing-journey-through-grief)\n\n193. [https://nymag.com/intelligencer/article/joe-biden-tragic-legacy-mourner-in-chief.html](https://nymag.com/intelligencer/article/joe-biden-tragic-legacy-mourner-in-chief.html)\n\n194. [https://www.washingtonpost.com/politics/2024/05/14/biden-nearly-died-an-aneurysm-risky-surgery-changed-his-life/](https://www.washingtonpost.com/politics/2024/05/14/biden-nearly-died-an-aneurysm-risky-surgery-changed-his-life/)\n\n195. [https://m.economictimes.com/news/international/us/joe-bidens-health-timeline-from-brain-aneurysms-to-prostate-cancer-diagnosis-in-2025/articleshow/121300718.cms](https://m.economictimes.com/news/international/us/joe-bidens-health-timeline-from-brain-aneurysms-to-prostate-cancer-diagnosis-in-2025/articleshow/121300718.cms)\n\n196. [https://www.nytimes.com/1988/05/04/us/biden-resting-after-surgery-for-second-brain-aneurysm.html](https://www.nytimes.com/1988/05/04/us/biden-resting-after-surgery-for-second-brain-aneurysm.html)\n\n197. [https://www.uclahealth.org/news/article/joe-bidens-history-of-stuttering-sheds-light-on-the-condition](https://www.uclahealth.org/news/article/joe-bidens-history-of-stuttering-sheds-light-on-the-condition)\n\n198. [https://www.wtrf.com/top-stories/how-many-times-has-president-joe-biden-fallen-so-far/](https://www.wtrf.com/top-stories/how-many-times-has-president-joe-biden-fallen-so-far/)\n\n199. [https://www.cnn.com/2008/HEALTH/10/20/biden.health/](https://www.cnn.com/2008/HEALTH/10/20/biden.health/)\n\n200. [https://www.cnbc.com/2019/12/17/joe-biden-campaign-releases-health-summary-from-doctor-in-2020-primary.html](https://www.cnbc.com/2019/12/17/joe-biden-campaign-releases-health-summary-from-doctor-in-2020-primary.html)\n\n201. [https://abc7.com/post/biden-shrugs-off-age-chatter-pledges-to-release-medical-records/5539576/](https://abc7.com/post/biden-shrugs-off-age-chatter-pledges-to-release-medical-records/5539576/)\n\n202. [https://nypost.com/article/worst-joe-biden-gaffes/](https://nypost.com/article/worst-joe-biden-gaffes/)\n\n203. [https://www.foxnews.com/politics/majority-voters-think-biden-cognitively-unfit-serve-president-poll](https://www.foxnews.com/politics/majority-voters-think-biden-cognitively-unfit-serve-president-poll)\n\n204. [https://www.nydailynews.com/2024/02/21/biden-trump-mentally-unfit-quinnipiac-poll/](https://www.nydailynews.com/2024/02/21/biden-trump-mentally-unfit-quinnipiac-poll/)\n\n205. [https://www.justice.gov/storage/report-from-special-counsel-robert-k-hur-february-2024.pdf](https://www.justice.gov/storage/report-from-special-counsel-robert-k-hur-february-2024.pdf)\n\n206. [https://www.axios.com/2025/05/16/biden-hur-tape-special-counsel-audio](https://www.axios.com/2025/05/16/biden-hur-tape-special-counsel-audio)\n\n207. [https://www.bbc.com/news/articles/c9q047dgvyno](https://www.bbc.com/news/articles/c9q047dgvyno)\n\n208. [https://www.npr.org/2025/05/19/nx-s1-5309451/biden-health-decline-original-sin](https://www.npr.org/2025/05/19/nx-s1-5309451/biden-health-decline-original-sin)\n\n209. [https://www.theguardian.com/books/2025/may/25/original-sin-joe-biden-book-review](https://www.theguardian.com/books/2025/may/25/original-sin-joe-biden-book-review)\n\n210. [https://www.pbs.org/newshour/show/white-house-pushes-back-on-special-counsels-criticism-of-bidens-mental-fitness](https://www.pbs.org/newshour/show/white-house-pushes-back-on-special-counsels-criticism-of-bidens-mental-fitness)\n\n211. [https://www.bbc.com/news/world-us-canada-68244611](https://www.bbc.com/news/world-us-canada-68244611)\n\n212. [https://www.npr.org/2025/05/14/nx-s1-5397210/biden-trump-election-original-sin-book](https://www.npr.org/2025/05/14/nx-s1-5397210/biden-trump-election-original-sin-book)\n\n213. [https://www.nytimes.com/1987/09/18/us/biden-admits-plagiarism-in-school-but-says-it-was-not-malevolent.html](https://www.nytimes.com/1987/09/18/us/biden-admits-plagiarism-in-school-but-says-it-was-not-malevolent.html)\n\n214. [https://www.washingtonpost.com/archive/politics/1987/09/18/biden-admits-plagiarizing-in-law-school/53047c90-c16d-4f3a-9317-a106be8f6102/](https://www.washingtonpost.com/archive/politics/1987/09/18/biden-admits-plagiarizing-in-law-school/53047c90-c16d-4f3a-9317-a106be8f6102/)\n\n215. [https://www.newsweek.com/did-joe-biden-cheat-law-school-what-he-has-said-about-stupid-mistake-1708548](https://www.newsweek.com/did-joe-biden-cheat-law-school-what-he-has-said-about-stupid-mistake-1708548)\n\n216. [https://www.nytimes.com/1987/09/18/us/in-hindsight-biden-s-law-teacher-sees-offense-as-minor.html](https://www.nytimes.com/1987/09/18/us/in-hindsight-biden-s-law-teacher-sees-offense-as-minor.html)\n\n217. [https://www.nytimes.com/1987/09/22/us/biden-admits-errors-and-criticizes-latest-report.html](https://www.nytimes.com/1987/09/22/us/biden-admits-errors-and-criticizes-latest-report.html)\n\n218. [https://apnews.com/article/cd977f7ff301993f7976974ba07c5495](https://apnews.com/article/cd977f7ff301993f7976974ba07c5495)\n\n219. [https://www.politifact.com/article/2020/may/07/ad-watch-fact-checking-video-about-bidens-academic/](https://www.politifact.com/article/2020/may/07/ad-watch-fact-checking-video-about-bidens-academic/)\n\n220. [https://www.politifact.com/factchecks/2022/jan/13/joe-biden/evidence-scant-joe-biden-was-arrested-protesting-c/](https://www.politifact.com/factchecks/2022/jan/13/joe-biden/evidence-scant-joe-biden-was-arrested-protesting-c/)\n\n221. [https://www.washingtonpost.com/politics/2022/01/13/biden-claims-yet-another-arrest-which-theres-little-evidence/](https://www.washingtonpost.com/politics/2022/01/13/biden-claims-yet-another-arrest-which-theres-little-evidence/)\n\n222. [https://www.factcheck.org/2024/04/bidens-dubious-civil-rights-arrest-anecdote/](https://www.factcheck.org/2024/04/bidens-dubious-civil-rights-arrest-anecdote/)\n\n223. [https://theintercept.com/2020/02/14/ahead-south-carolina-vote-joe-biden-faces-questions-claims-civil-rights-activism-2/](https://theintercept.com/2020/02/14/ahead-south-carolina-vote-joe-biden-faces-questions-claims-civil-rights-activism-2/)\n\n224. [https://www.youtube.com/watch?v=eIwwsCqEtpM](https://www.youtube.com/watch?v=eIwwsCqEtpM)\n\n225. [https://www.nytimes.com/2022/10/10/us/politics/biden-exaggeration-falsehood.html](https://www.nytimes.com/2022/10/10/us/politics/biden-exaggeration-falsehood.html)\n\n226. [https://oversight.house.gov/the-bidens-influence-peddling-timeline/](https://oversight.house.gov/the-bidens-influence-peddling-timeline/)\n\n227. [https://waysandmeans.house.gov/2023/12/19/mountains-of-evidence-show-joe-biden-was-complicit-in-hunters-global-influence-peddling-scheme/](https://waysandmeans.house.gov/2023/12/19/mountains-of-evidence-show-joe-biden-was-complicit-in-hunters-global-influence-peddling-scheme/)\n\n228. [https://oversight.house.gov/release/comer-reveals-how-joe-biden-received-laundered-china-money/](https://oversight.house.gov/release/comer-reveals-how-joe-biden-received-laundered-china-money/)\n\n229. [https://www.grassley.senate.gov/news/remarks/grassley-johnson-release-bank-records-tying-biden-family-to-ccp-linked-individuals-and-companies](https://www.grassley.senate.gov/news/remarks/grassley-johnson-release-bank-records-tying-biden-family-to-ccp-linked-individuals-and-companies)\n\n230. [https://www.politico.com/news/2023/11/05/hunter-joe-biden-business-testimony-00125056](https://www.politico.com/news/2023/11/05/hunter-joe-biden-business-testimony-00125056)\n\n231. [https://www.nbcnews.com/news/records-released-house-republicans-show-joe-biden-repeatedly-emailed-h-rcna130682](https://www.nbcnews.com/news/records-released-house-republicans-show-joe-biden-repeatedly-emailed-h-rcna130682)\n\n232. [https://www.nbcnews.com/politics/congress/biden-spoke-sons-business-associates-numerous-former-partner-tells-law-rcna97410](https://www.nbcnews.com/politics/congress/biden-spoke-sons-business-associates-numerous-former-partner-tells-law-rcna97410)\n\n233. [https://oversight.house.gov/wp-content/uploads/2023/08/Third-Bank-Records-Memorandum\\_Redacted.pdf](https://oversight.house.gov/wp-content/uploads/2023/08/Third-Bank-Records-Memorandum_Redacted.pdf)\n\n234. [https://oversight.house.gov/release/comer-oversight-committee-has-uncovered-mounting-evidence-tying-joe-biden-to-family-business-schemes/](https://oversight.house.gov/release/comer-oversight-committee-has-uncovered-mounting-evidence-tying-joe-biden-to-family-business-schemes/)\n\n235. [https://oversight.house.gov/wp-content/uploads/2024/08/2024.08.19-Report-of-the-Impeachment-Inquiry-of-Joseph-R.-Biden-Jr.-President-of-the-United-States.pdf](https://oversight.house.gov/wp-content/uploads/2024/08/2024.08.19-Report-of-the-Impeachment-Inquiry-of-Joseph-R.-Biden-Jr.-President-of-the-United-States.pdf)\n\n236. [https://www.pbs.org/newshour/politics/former-fbi-informant-to-plead-guilty-to-lying-about-fake-bribery-scheme-involving-the-bidens](https://www.pbs.org/newshour/politics/former-fbi-informant-to-plead-guilty-to-lying-about-fake-bribery-scheme-involving-the-bidens)\n\n237. [https://www.bbc.com/news/world-us-canada-66792083](https://www.bbc.com/news/world-us-canada-66792083)\n\n238. [https://www.govinfo.gov/content/pkg/CHRG-118hhrg51854/html/CHRG-118hhrg51854.htm](https://www.govinfo.gov/content/pkg/CHRG-118hhrg51854/html/CHRG-118hhrg51854.htm)\n\n239. [https://www.congress.gov/event/118th-congress/house-event/LC74391/text](https://www.congress.gov/event/118th-congress/house-event/LC74391/text)\n\n240. [https://www.thune.senate.gov/public/index.cfm/2021/9/thune-biden-ignored-top-military-commanders-and-endangered-americans-created-catastrophic-withdrawal-from-afghanistan](https://www.thune.senate.gov/public/index.cfm/2021/9/thune-biden-ignored-top-military-commanders-and-endangered-americans-created-catastrophic-withdrawal-from-afghanistan)\n\n241. [https://homeland.house.gov/2024/10/24/startling-stats-factsheet-fiscal-year-2024-ends-with-nearly-3-million-inadmissible-encounters-10-8-million-total-encounters-since-fy2021/](https://homeland.house.gov/2024/10/24/startling-stats-factsheet-fiscal-year-2024-ends-with-nearly-3-million-inadmissible-encounters-10-8-million-total-encounters-since-fy2021/)\n\n242. [https://www.cdc.gov/nchs/nvss/vsrr/drug-overdose-data.htm](https://www.cdc.gov/nchs/nvss/vsrr/drug-overdose-data.htm)\n\n243. [https://www.cdc.gov/overdose-prevention/about/understanding-the-opioid-overdose-epidemic.html](https://www.cdc.gov/overdose-prevention/about/understanding-the-opioid-overdose-epidemic.html)\n\n244. [https://usafacts.org/articles/are-fentanyl-overdose-deaths-rising-in-the-us/](https://usafacts.org/articles/are-fentanyl-overdose-deaths-rising-in-the-us/)\n\n245. [https://www.bbc.com/news/world-us-canada-68245617](https://www.bbc.com/news/world-us-canada-68245617)\n\n246. [https://www.npr.org/2024/02/08/1200897377/biden-classified-documents-investigation](https://www.npr.org/2024/02/08/1200897377/biden-classified-documents-investigation)\n\n247. [https://www.reuters.com/world/us/biden-says-inflation-temporary-fed-should-do-what-it-deems-necessary-recovery-2021-07-19/](https://www.reuters.com/world/us/biden-says-inflation-temporary-fed-should-do-what-it-deems-necessary-recovery-2021-07-19/)\n\n248. [https://thehill.com/business/4529787-yellen-regrets-saying-inflation-transitory/](https://thehill.com/business/4529787-yellen-regrets-saying-inflation-transitory/)\n\n249. [https://www.npr.org/2023/06/30/1182216970/supreme-court-student-loan-forgiveness-decision-biden](https://www.npr.org/2023/06/30/1182216970/supreme-court-student-loan-forgiveness-decision-biden)\n\n250. [https://www.factcheck.org/2019/07/biden-on-the-1994-crime-bill/](https://www.factcheck.org/2019/07/biden-on-the-1994-crime-bill/)\n\n251. [https://www.c-span.org/clip/senate-proceeding/user-clip-joe-biden-speech-on-1994-crime-bill-predators-on-our-streets/4879694](https://www.c-span.org/clip/senate-proceeding/user-clip-joe-biden-speech-on-1994-crime-bill-predators-on-our-streets/4879694)\n\n252. [https://www.snopes.com/fact-check/biden-racial-jungle-quote/](https://www.snopes.com/fact-check/biden-racial-jungle-quote/)\n\n253. [https://www.politifact.com/truth-o-meter/promises/biden-promise-tracker/promise/1525/eliminate-cash-bail/article/3014/](https://www.politifact.com/truth-o-meter/promises/biden-promise-tracker/promise/1525/eliminate-cash-bail/article/3014/)\n\n254. [https://www.themarshallproject.org/2020/11/08/what-biden-s-win-means-for-the-future-of-criminal-justice](https://www.themarshallproject.org/2020/11/08/what-biden-s-win-means-for-the-future-of-criminal-justice)\n\n255. [https://www.washingtonpost.com/politics/2024/04/17/biden-abortion-stances/](https://www.washingtonpost.com/politics/2024/04/17/biden-abortion-stances/)\n\n256. [https://www.nbcnews.com/politics/2020-election/biden-s-long-evolution-abortion-rights-still-holds-surprises-n1013846](https://www.nbcnews.com/politics/2020-election/biden-s-long-evolution-abortion-rights-still-holds-surprises-n1013846)\n\n257. [https://www.cnn.com/2022/05/03/politics/joe-biden-abortion-draft-opinion](https://www.cnn.com/2022/05/03/politics/joe-biden-abortion-draft-opinion)\n\n258. [https://www.nbcnews.com/politics/joe-biden/bidens-roe-v-wade-abortion-rcna147021](https://www.nbcnews.com/politics/joe-biden/bidens-roe-v-wade-abortion-rcna147021)\n\n259. [https://www.washingtonpost.com/politics/2022/06/04/biden-assault-weapons-ban/](https://www.washingtonpost.com/politics/2022/06/04/biden-assault-weapons-ban/)\n\n260. [https://www.bbc.com/news/world-us-canada-56509481](https://www.bbc.com/news/world-us-canada-56509481)\n\n261. [https://bidenwhitehouse.archives.gov/briefing-room/statements-releases/2022/06/23/statement-by-president-joe-biden-on-supreme-court-ruling-on-guns/](https://bidenwhitehouse.archives.gov/briefing-room/statements-releases/2022/06/23/statement-by-president-joe-biden-on-supreme-court-ruling-on-guns/)\n\n262. [https://www.lwv.org/blog/understanding-supreme-courts-gun-control-decision-nysrpa-v-bruen](https://www.lwv.org/blog/understanding-supreme-courts-gun-control-decision-nysrpa-v-bruen)\n\n263. [https://www.cbsnews.com/news/biden-supports-trade-deal-despite-opposition-from-unions/](https://www.cbsnews.com/news/biden-supports-trade-deal-despite-opposition-from-unions/)\n\n264. [https://www.politico.com/newsletters/morning-trade/2019/08/01/biden-says-he-would-renegotiate-tpp-464000](https://www.politico.com/newsletters/morning-trade/2019/08/01/biden-says-he-would-renegotiate-tpp-464000)\n\n265. [https://www.cnn.com/2020/10/23/politics/biden-fracking-fact-check](https://www.cnn.com/2020/10/23/politics/biden-fracking-fact-check)\n\n266. [https://www.reuters.com/article/world/americas/us-presidential-hopeful-biden-says-he-would-not-ban-fracking-idUSKBN25R2NI/](https://www.reuters.com/article/world/americas/us-presidential-hopeful-biden-says-he-would-not-ban-fracking-idUSKBN25R2NI/)\n\n267. [https://www.cnbc.com/2021/01/27/biden-suspends-oil-and-gas-drilling-in-series-of.html](https://www.cnbc.com/2021/01/27/biden-suspends-oil-and-gas-drilling-in-series-of.html)\n\n268. [https://www.politifact.com/factchecks/2020/jun/29/viral-image/biden-said-without-orderly-integration-his-childre/](https://www.politifact.com/factchecks/2020/jun/29/viral-image/biden-said-without-orderly-integration-his-childre/)\n\n269. [https://www.usatoday.com/story/news/factcheck/2020/10/27/fact-check-post-partly-false-biden-1977-racial-jungle-remark/6045749002/](https://www.usatoday.com/story/news/factcheck/2020/10/27/fact-check-post-partly-false-biden-1977-racial-jungle-remark/6045749002/)\n\n270. [https://www.nytimes.com/2020/06/02/us/politics/joe-biden-philadelphia-protests.html](https://www.nytimes.com/2020/06/02/us/politics/joe-biden-philadelphia-protests.html)\n\n271. [https://www.vox.com/2020/8/19/21372408/joe-biden-racial-justice-policy](https://www.vox.com/2020/8/19/21372408/joe-biden-racial-justice-policy)\n\n272. [https://www.wpr.org/politics/joe-biden-visits-kenosha-urges-optimism-and-unity-wake-unrest](https://www.wpr.org/politics/joe-biden-visits-kenosha-urges-optimism-and-unity-wake-unrest)\n\n273. [https://www.nbcnews.com/politics/2020-election/unrest-grips-u-s-trump-fuels-fire-biden-pledges-extinguish-n1222296](https://www.nbcnews.com/politics/2020-election/unrest-grips-u-s-trump-fuels-fire-biden-pledges-extinguish-n1222296)\n\n274. [https://www.pbs.org/newshour/politics/watch-fund-the-police-biden-says-at-state-of-the-union](https://www.pbs.org/newshour/politics/watch-fund-the-police-biden-says-at-state-of-the-union)\n\n275. [https://www.nbcnews.com/politics/politics-news/biden-budget-proposal-calls-increase-law-enforcement-spending-rcna21871](https://www.nbcnews.com/politics/politics-news/biden-budget-proposal-calls-increase-law-enforcement-spending-rcna21871)\n\n276. [https://www.cnn.com/2021/02/17/politics/defunding-police-biden-town-hall-trnd](https://www.cnn.com/2021/02/17/politics/defunding-police-biden-town-hall-trnd)\n\n277. [https://www.justice.gov/opa/pr/us-department-justices-civil-rights-division-dismisses-biden-era-police-investigations-and](https://www.justice.gov/opa/pr/us-department-justices-civil-rights-division-dismisses-biden-era-police-investigations-and)\n\n278. [https://www.npr.org/2025/05/21/nx-s1-5406342/doj-moves-to-dismiss-police-consent-decrees-in-louisville-and-minneapolis](https://www.npr.org/2025/05/21/nx-s1-5406342/doj-moves-to-dismiss-police-consent-decrees-in-louisville-and-minneapolis)\n\n279. [https://www.politico.com/news/2025/05/21/doj-biden-police-reform-agreements-00362247](https://www.politico.com/news/2025/05/21/doj-biden-police-reform-agreements-00362247)\n\n280. [https://www.aclu.org/press-releases/aclu-and-community-groups-demand-justice-and-transparency-as-trump-doj-abandons-federal-police-oversight](https://www.aclu.org/press-releases/aclu-and-community-groups-demand-justice-and-transparency-as-trump-doj-abandons-federal-police-oversight)\n\n281. [https://www.cnbc.com/2024/03/11/bidens-2025-budget-marries-progressive-tax-hikes-with-populist-campaign-planks.html](https://www.cnbc.com/2024/03/11/bidens-2025-budget-marries-progressive-tax-hikes-with-populist-campaign-planks.html)\n\n282. [https://taxfoundation.org/research/all/federal/biden-budget-2025-tax-proposals/](https://taxfoundation.org/research/all/federal/biden-budget-2025-tax-proposals/)\n\n283. [https://taxfoundation.org/blog/largest-tax-cuts-hikes-biden-trump-tax-proposals/](https://taxfoundation.org/blog/largest-tax-cuts-hikes-biden-trump-tax-proposals/)\n\n284. [https://bidenwhitehouse.archives.gov/briefing-room/statements-releases/2024/03/11/fact-sheet-the-presidents-budget-cuts-taxes-for-working-families-and-makes-big-corporations-and-the-wealthy-pay-their-fair-share/](https://bidenwhitehouse.archives.gov/briefing-room/statements-releases/2024/03/11/fact-sheet-the-presidents-budget-cuts-taxes-for-working-families-and-makes-big-corporations-and-the-wealthy-pay-their-fair-share/)",
    "metadata": {
      "og:description": "Joseph Robinette Biden Jr. (born November 20, 1942) is an American politician and attorney who served as the 46th president of the United States from January 20, 2021, to January 20, 2025. A member of the Democratic Party, he represented Delaware in the U.S. Senate from 1973 to 2009, becoming one of its longest-serving members, and then served as the 47th vice president under Barack Obama from 2009 to 2017. In the Senate, Biden chaired the Judiciary Committee from 1987 to 1995, overseeing...",
      "og:url": "https://grokipedia.com/page/Joe_Biden",
      "keywords": "Biden, Joseph Biden, Joseph R. Biden, Sleepy Joe",
      "ogUrl": "https://grokipedia.com/page/Joe_Biden",
      "ogImage": "https://grokipedia.com/icon-512x512.png",
      "author": "system",
      "article:modified_time": "1970-01-21T09:19:44.592Z",
      "googlebot": "index, follow, max-snippet:-1",
      "title": "Joe Biden | Grokipedia",
      "og:image": "https://grokipedia.com/icon-512x512.png",
      "og:image:height": "512",
      "twitter:card": "summary",
      "viewport": "width=device-width, initial-scale=1",
      "twitter:title": "Joe Biden",
      "favicon": "https://grokipedia.com/favicon.ico",
      "og:type": "article",
      "ogSiteName": "Grokipedia",
      "ogLocale": "en",
      "robots": "index, follow",
      "og:site_name": "Grokipedia",
      "og:title": "Joe Biden",
      "next-size-adjust": "",
      "og:locale": "en",
      "modifiedTime": "1970-01-21T09:19:44.592Z",
      "twitter:creator": "@grok",
      "description": "Joseph Robinette Biden Jr. (born November 20, 1942) is an American politician and attorney who served as the 46th president of the United States from January 20, 2021, to January 20, 2025. A member of the Democratic Party, he represented Delaware in the U.S. Senate from 1973 to 2009, becoming one of its longest-serving members, and then served as the 47th vice president under Barack Obama from 2009 to 2017. In the Senate, Biden chaired the Judiciary Committee from 1987 to 1995, overseeing...",
      "ogTitle": "Joe Biden",
      "ogDescription": "Joseph Robinette Biden Jr. (born November 20, 1942) is an American politician and attorney who served as the 46th president of the United States from January 20, 2021, to January 20, 2025. A member of the Democratic Party, he represented Delaware in the U.S. Senate from 1973 to 2009, becoming one of its longest-serving members, and then served as the 47th vice president under Barack Obama from 2009 to 2017. In the Senate, Biden chaired the Judiciary Committee from 1987 to 1995, overseeing...",
      "language": "en",
      "og:image:width": "512",
      "og:image:alt": "Joe Biden",
      "twitter:image": "https://grokipedia.com/icon-512x512.png",
      "sentry-trace": "ee655f795123e7fa70478d9e21a77e01-5a574a9941fb2ce3-1",
      "baggage": "sentry-environment=production,sentry-public_key=5f2258f71198ee26a355127af230c3a6,sentry-trace_id=ee655f795123e7fa70478d9e21a77e01,sentry-org_id=4508179396558848,sentry-transaction=GET%20%2Fpage%2F%5Bslug%5D,sentry-sampled=true,sentry-sample_rand=0.7613412826460166,sentry-sample_rate=1",
      "twitter:description": "Joseph Robinette Biden Jr. (born November 20, 1942) is an American politician and attorney who served as the 46th president of the United States from January 20, 2021, to January 20, 2025. A member of the Democratic Party, he represented Delaware in the U.S. Senate from 1973 to 2009, becoming one of its longest-serving members, and then served as the 47th vice president under Barack Obama from 2009 to 2017. In the Senate, Biden chaired the Judiciary Committee from 1987 to 1995, overseeing...",
      "scrapeId": "f7569c80-686d-4337-99b2-e4550a4e0d9f",
      "sourceURL": "https://grokipedia.com/page/Joe_Biden",
      "url": "https://grokipedia.com/page/Joe_Biden",
      "statusCode": 200,
      "contentType": "text/html; charset=utf-8",
      "proxyUsed": "basic",
      "cacheState": "miss",
      "indexId": "08bef7b9-1f4b-4eed-9890-0e885a786a42",
      "creditsUsed": 1
    }
  },
  "scrape_id": "f7569c80-686d-4337-99b2-e4550a4e0d9f",
  "id": "LPlntV-767uTlzls7MYgJ",
  "startedAt": "2025-10-28T20:24:48.779Z",
  "endedAt": "2025-10-28T20:24:55.944Z",
  "endpoint": "scrape",
  "formState": {
    "extractSetupCompleted": false,
    "urls": [],
    "extractSchema": {
      "type": "object",
      "required": [],
      "properties": {
        "company_mission": {
          "type": "string"
        },
        "supports_sso": {
          "type": "boolean"
        },
        "is_open_source": {
          "type": "boolean"
        },
        "is_in_yc": {
          "type": "boolean"
        }
      }
    },
    "extractPrompt": "Extract the company details, following the schema.",
    "enableWebSearch": false,
    "options": {
      "onlyMainContent": false,
      "parsePDF": true,
      "stealthMode": false,
      "excludeTags": [],
      "includeTags": [],
      "waitFor": "",
      "timeout": "",
      "maxAge": "2 days",
      "ignoreSitemap": false,
      "crawlEntireDomain": false,
      "sitemap": "include",
      "limit": "10",
      "maxDepth": "",
      "excludePaths": [],
      "includePaths": [],
      "includeSubdomains": false,
      "search": "",
      "scrapeContentFromSearchResults": true,
      "timeBasedSearch": "",
      "location": "",
      "prompt": ""
    },
    "formats": [
      "markdown"
    ],
    "sources": [
      "web"
    ],
    "categories": [],
    "jsonSchema": {
      "type": "object",
      "required": [],
      "properties": {
        "company_name": {
          "type": "string"
        },
        "company_description": {
          "type": "string"
        }
      }
    },
    "jsonPrompt": "",
    "agent": {},
    "url": "grokipedia.com/page/Joe_Biden",
    "endpoint": "scrape"
  },
  "status": "success",
  "version": "b6IYPsmuYUZs7yLlhGrx5"
}